{"brand": "MAKE UP FOR EVER", "comment": {"content": ["I recieved this foundation from influenster to review and I've tried it for like two weeks and so far I'm in love with the foundation. It feels like you have nothing on your skin and it lasts pretty much all day. This was a foundation I was going to buy but I'm so glad i tried it and totally will be purchasing it once I run out of it", "Having very fair skin, I was excited to try this since it came in my tone. It's a good foundation but just not enough coverage for me. Very sheer and doesn't really cover imperfections.", "I really like this product. I purchased it after my daughter had a makeover at Sephora using this foundation. She looked absolutely flawless. I tried it for myself and also like it very much. I have skin that tends to be on the dry side and this works well for me.", "I wanted to love this and it was recommended at two separate locations, but I tried using it with 3 different primers and then without a primer and every single time it just sat so severely in every line and pore. I'm just passing the mid-twenties mark, I should not look like I'm in my late 50s with the way this sat in minor wrinkles and fine lines. So drying as well. I was so sad, because it was one brand that had a color that matched my skin so well", "I have combination skin, acne, larger pores. I've tried so many high end foundations and could never find one that I just fell in love with. I finally gave this one a try and have been hooked ever since! I never want to use my old go to anymore because I love this stuff so much!", "This foundation comes in a lot of shades which helps match the perfect color with your own. It's build able and long lasting. I had a matte finish and hardly had to blot (3 times in 6 hours). I have very oily skin and was very happy with the finish."], "date": ["6 Oct 2016", "23 Nov 2015", "12 Jan 2016", "26 Jan 2017", "12 Dec 2015", "22 Sep 2015"], "score": [4, 3, 5, 2, 5, 4], "title": ["amazing", "just okay", "Great Coverage", "so sad", "finally!", "Ultra HD Invisible Cover Foundation Review"]}, "figure_URL": ["https://www.sephora.com/productimages/sku/s1708957-main-grid.jpg"], "id": 1, "mini_figure_URL": ["https://www.sephora.com/productimages/sku/s1708957-main-grid.jpg"], "name": "Ultra HD Invisible Cover Foundation", "price": 19.0, "review_score": 3, "source": {"original_price": [19.0], "product_URL": ["https://www.sephora.com/product/ultra-hd-invisible-cover-foundation-P398321?icid2=products grid:p398321:product"], "source": ["Sephora"]}}