{"brand": "Yves Saint Laurent", "comment": {"content": ["I live in very humid and hot climate. I have been on the hunt for a new holy grail foundation after wearing my holy grail foundation for over 20 years. I tried so many foundations and this is almost my holy grail. It does not last 24 hours on me, not even close to 8 hours. It transfers onto everything. But it makes your face look so incredible and I receive so many compliments on how beautiful my face looks. This is why I keep trying to make it work. This does have a tiny fragrance. Normally I cannot wear foundation with fragrance, but this does not bother me. I wear BD40. The shade does oxide a bit, wait about 5 minutes before settling your shade match. I apply with a brush because a beauty blender just drinks up this expensive foundation. This is an expensive foundation for .84oz (25mL) when other companies provide a full 1 oz (30mL). The instructions say you only need a few pumps. If you want full coverage, you will need to use more than 1 pump for your entire face. This is more of a high medium coverage. I will use 1 pump on each side of my face. I have alot of freckles on my cheeks that I want to cover. This is an excellent foundation for more mature skin. It did not settle into my fine lines and wrinkles. I have enlarged pores since I am oily, this does not sink into my pores. I was able to find a color for my golden undertones. It actually makes the face look youthful. If you have drier skin, this might last a longer time, but on my oily skin, it comes no where close to 24 hours. At the 3 hour mark, I get shiny and need to remove the excess oils. At the 5 hour mark, it starts to sink to my smile lines around my mouth, but I just use some powder and they disappear. This foundation formula is so good that even not using a primer, the foundation lays beautifully on my skin. I am not really a primer girl, but I want this foundation to last, so I tried many primers including the famous YSL primer. This primer does not make the foundation last longer, but it does smooth the skin to make it look even more flawless until the oils come through. The two oil controlling primers that I like the best for Mineral Veil primer and Dr Brant pores no more. I am still on the hunt for a holy grail foundation. I still keep trying new foundations, but over the last year that I have been searching, I keep coming back to this one.", "I was using the same foundation one shade lighter and realized that I needed something a little darker for the summer. This was perfect and looking very natural. Love it.", "GIVES YOU A FLAWLESS MATTE FINISH. SKING FEELS FRESH. AMAZING RESULTS!!! LOV IT"], "date": ["08/30/18", "08/06/18", "03/22/18"], "score": [3, 5, 5], "title": ["Almost holy grail", "Perfect summer color match", "AMAZING FOUNDATION"]}, "figure_URL": ["https://images.bloomingdalesassets.com/is/image/BLM/products/9/optimized/9629459_fpx.tif?$2014_BROWSE_FASHION$&hei=350&wid=280"], "id": 104, "mini_figure_URL": ["https://images.bloomingdalesassets.com/is/image/BLM/products/9/optimized/9629459_fpx.tif?$2014_BROWSE_FASHION$&hei=350&wid=280"], "name": "All Hours Full Coverage Matte Foundation", "price": 54.0, "review_score": 4, "source": {"original_price": [54.0], "product_URL": ["https://www.bloomingdales.com/shop/product/yves-saint-laurent-all-hours-full-coverage-matte-foundation?ID=2713572&CategoryID=2921"], "source": ["Bloomindale"]}}