{"brand": "Urban Decay", "comment": {"content": ["My first Foundation that is excellent for my skin. I got the naked shade 4 because I tan a little bit during Summer. It works perfectly with my oil skin too", "As someone with combination skin, I have always struggled with foundations. My skin is on the yellow-y, olive tone and I do have some acne and oily spots. This foundation was a game changer though and I will use it for years to come. I find a bottle lasts me about two months because it blends well and a little goes a long way. I use it with a primer and Urban Decay matte setting spray and my skin glows. I'm constantly asked what makeup I use because my skin looks so gorgeous and glowy. Well worth every penny!", "I love this liquid makeup! It goes on smoothly, blends in well, lasts all day. The choices in colors make it easy to match your skin.", "nice lightweight foundation, with very good coverage. Goes on smoothly", "This might be my new holy grail foundation, absolutely love it! The consistency and coverage reminds me of Bobbi Brown skin foundation. It is long lasting (even in hot weather), covers any redness on my face, and feels extremely light.\n\nI have found that when you first apply the foundation it may seem light, but once it dries and sets it gets slightly darker.", "LOVE this foundation. I used to use Bare Minerals as I liked a subtle finish. This gives better coverage, still looks natural, and feels better on my skin. My forehead is less oily and the coverage can be built up to hide imperfections without looking thick."], "date": ["13 Jul 2015", "24 Nov 2014", "17 Jun 2013", "13 Dec 2012", "19 Sep 2012", "21 Dec 2014"], "score": [5, 5, 5, 5, 5, 5], "title": ["love it", "The perfect foundation", "Love, Love, Love", "nice coverage", "Perfection!", "Feels light, no shine, buildable beauty"]}, "figure_URL": ["https://www.sephora.com/productimages/sku/s1434919-main-grid.jpg"], "id": 11, "mini_figure_URL": ["https://www.sephora.com/productimages/sku/s1434919-main-grid.jpg"], "name": "Naked Skin Weightless Ultra Definition Liquid Foundation", "price": 40.0, "review_score": 4, "source": {"original_price": [40.0], "product_URL": ["https://www.sephora.com/product/naked-weightless-ultra-definition-liquid-makeup-P374830?icid2=products grid:p374830:product"], "source": ["Sephora"]}}