{"brand": "Marc Jacobs Beauty", "comment": {"content": ["I got this for free from Influenster. If I hadn’t, I would not have purchased. The lip color twists up but you can not twist it back down. While the floss is very shiny and comfortable to wear, they are full of glitter", "I like how this feels on, but the color is much pinker on my lips than when I sampled it on my hand before buying. I also really don't like that it can only go up and doesn't retract down into the case-- I actually really don't understand that.", "This was recommended to me when I said I wanted a red lip color that wasn't really red red but more sheer but still had color and some other ridiculousness.  The associate brought me this, and it was perfect.  A sheer wash of color that's still color, a red that's not overpowering, and it moisturizes.  It doesn't last forever, but what lip product does?  Pricey, but a holy grail of lip products.", "I love lip glosses but they can be such a hassle and get kind of messy. Because of this I always found myself wearing lip balms instead. When this product was released I immediately bought it. Its really exactly what I was looking for and the best of both world. Shiny like a gloss but because it is a stick its easy to apply on the go and throw into your bag. Not to mention so moisturizing. After buying my first one I went back to the store the next day and bought two more!!"], "date": ["7 Jul 2018", "18 Jul 2018", "8 Nov 2018", "14 Sep 2018"], "score": [1, 3, 5, 5], "title": ["What goes up won't go down??", "Worth the money.", "Worth the $! Looks beautiful", "I like it no matter what"]}, "figure_URL": ["https://www.sephora.com/productimages/sku/s2078020-main-grid.jpg"], "id": 241, "mini_figure_URL": ["https://www.sephora.com/productimages/sku/s2078020-main-grid.jpg"], "name": "Enamored Hydrating Lip Gloss Stick", "price": 28.0, "review_score": 4, "source": {"original_price": [28.0], "product_URL": ["https://www.sephora.com/product/enamored-hydrating-lip-gloss-stick-P431545?icid2=products grid:p431545:product"], "source": ["Sephora"]}}