{"brand": "tarte", "comment": {"content": ["I ordered this by accident, thinking I was getting the Tarte Shape Tape (don't ask me how, I clearly don't know how to read). I'd heard nothing but good things about that product and everyone else had it so I wanted it too.\nWhen I realized the mistake I'd made I had absolutely every intention of sending this back, but I've never spent more than $20 on a concealer before and decided I'd give it a whirl because I want to feel luxurious sometimes.\nAs I'm sure you've gathered from my five-star rating, this turned out to be a happy accident. I have bad acne scarring and I love how this covers it. It's lightweight, it doesn't crease, it really evens my skin tone and does a BEAUTIFUL job reducing the appearance of the bumps and scarring on my cheeks.\nAs I previously mentioned, I'm cheap when it comes to concealer so I can't really compare it to other higher end brands, but I truly love this product and I've re-purchased twice. I don't feel a need to try anything else.", "This concealer is the absolute perfect shade for my skin. I use it under my eyes and it doesn’t crease (I do use the Laura Mercier under eye setting powder). It kind of has this diffusing effect on me and it is full coverage but feels weightless. I have really dark hereditary under eye circles and this is as close to a HG concealer as I’ve found. Definitely recommend.", "I have combo skin, so this product seemed to attach to my dry patches. Making my skin look uneven and terrible. Also I should have listened to the review before because this has a terrible chemical smell. I have fair skin, but I feel like tarte has a more orange tone to it.", "I am a fairly light-skinned woman, so I was pretty concerned about looking washed out or having a concealer that was darker than my foundation.Thankfully, I avoided both of those. I love this concealer to death! I use the shade \"light\", and I use it with my Tarte Amazonian Clay Full Coverage Foundation (in the shade of \"Light Medium\"). They're the perfect duo! \r\nA little can go a long way, depending on how you blend it and where you put it. I use this concealer on my chin, the tip of my nose, in between my eyebrows, the corners of my lips, and underneath my eyes. \r\nMy only complaint is the wand/applicator- it can get messy. That, and I've noticed a lot of product can end up on the inside of the lid even though I set it back in my makeup drawer sitting up straight. \r\nOther than that, Tarte is becoming the #1 brand of foundation AND concealer that I recommend to my friends! Definitely worth the $$$", "Love this product. Gives great coverage under eyes with small amount. I use the Sephora Pro Airbrush Concealer brush which blends it well."], "date": ["6 Mar 2018", "19 Oct 2018", "18 Feb 2017", "30 Nov 2016", "15 Feb 2017"], "score": [5, 5, 2, 4, 5], "title": ["I don't know much about makeup, but..", "Possible HG under eye concealer", "Terrible", "My Kind Of Concealer", "great!"]}, "figure_URL": ["https://www.sephora.com/productimages/sku/s1779099-main-grid.jpg"], "id": 228, "mini_figure_URL": ["https://www.sephora.com/productimages/sku/s1779099-main-grid.jpg"], "name": "Aquacealer Concealer - Rainforest of the Sea Collection", "price": 26.0, "review_score": 3, "source": {"original_price": [26.0], "product_URL": ["https://www.sephora.com/product/rainforest-the-sea-aquacealer-concealer-P405598?icid2=products grid:p405598:product"], "source": ["Sephora"]}}