{"brand": "tarte", "comment": {"content": ["I'm so mad!  This used to be my HG concealer.  First, the new packaging is AWFUL for this type of formula.  Second, I'm not convinced it's the same formula at all.  \n\nI had some of the original left and I used them side by side (one on each eye).  This one is slightly more opaque than the previous version, but because you can't warm it on your fingers like the old version (without contaminating the product) it goes on really dry and is unpleasant to blend out with a brush (which is/used to be the best way to apply it!!)  The old formula, when lightly warmed between your finger and thumb, when on with a nice 'slip' to it. No tugging.  The new one is tug-tug-tug.\n\nDo not like.  Returning.  The search for a concealer begins again!", "First off, I would only recommend this concealer to anyone who struggles with dry skin as the consistency is VERY hydrating. And I mean possibly the thickest concealer I have ever tried. The main issue I have with this product is the fact that its not \"Creaseless\" like it says. If anything, this concealer creased under my under eyes worse than any other and I have tested out soo many concealers. The coverage is definitely more of medium than full, and can be buildable but it's also almost too thick to build up especially under the eyes. I also found it created such an unflattering texture once I would put translucent powder on even if I let it soak into my skin for 10 minutes, and it also tends to wear off pretty easily within a few hours. The only reason I'm giving it it 3 stars is because its very hydrating on my skin and has a decent coverage. But I would definitely not purchase this again.", "I will start this review by saying that I don't wear a ton of complexion products. I've been a BareMinerals Orginal Foundation girl for years. I also did not expect to like this concealer, but I really do. Recently I've been getting these dry patches on my nose, and sometimes on my chin. The powder foundation was no longer cutting it, as I felt it just highlighted the dryness. I also haven't been wearing a lot of complexion products because I just sweat too much in the NYC heat. Anyway, I recently wore this concealer and only put a TINY bit where I needed it and blended it into my skin. It provided great natural-looking coverage that became like a second skin. I also wear glasses, and even though I sweat where my glasses sit and basically all around my face for about 45 minutes on my way to work, it still looked great all day. I just dusted a little bit of setting powder on before I left the house and was good to go. If you use a light hand, it's a really great option for skin that could use a little TLC!", "MY NEW FAVORITE CONCEALER...\nI am almost 40 years old and this concealer does a disappearing act and I lose my wrinkles for a day.  When I first got it, I didn't like it because I used way too much, I used it like any other concealer. But this is super thick and only requires a little bit. Less is more with this concealer... If you have this concealer and you don't like it,  try using half of what you're used too.. It's AMAZING. So hydrating, so brightening and takes years off my under eyes...", "I used a promo code on Sephora.com and got a sample of this concealer.   I have to say I prefer it to Shape Tape.  I tried to love Shape Tape but I found that it emphasized my fine lines no matter what I did.  I compared both products today and the new one has a tacky consistency and is more reflective while ST is matte and creamy.  Both need to be set but the new one doesn’t settle into my lines like ST did.  It reminds me of my ride or die concealer, BECCA’s under eye brightening corrector.  Very similar feel but tarte’s is more opaque while BECCA’s is just a hint of coverage.  At the end of the day it’s a personal preference but hopefully enough people like this because I want tarte to keep making it!  (Btw I find that using a moisturizer under my eyes followed by a light oil, like Kora Organics noni radiant eye oil, helps keep the skin there plump and healthy looking and also helps my concealer go on smoothly).", "I have found if you apply the concealer under your eyes then let it sit for at least 2-3 minutes, then blend and top with setting powder it works really well. The coverage could be a little better, but it is extremely moisturizing.", "Like the coverage", "I absolutely love this concealer, I may even consider it my new HG! It truly lives up to its name. I have a couple fine lines under my eyes that obviously don't go away, however, the concealer does not emphasize them. In fact, it helps diminish them! It lasts all day. It is pretty thick so I tend to apply a little more than I would normally to help fill those fine lines and blend well with a beauty blender. Bottom line, y'all have to try this!", "This product claims that it is creaseless but that's a lie! This product creases immediately. This product is also very thick and hard to blend out. The only reason I purchased this was because the shape tape was sold out. Save your money.", "I waited very long to try this concealer due to the reviews. I also read or heard that it was the maracuja concealer repackaged which I had tried and did nothing special compared to other concealer.  Finally last weekend I was in the store and decided to check it out. Not sure if it is being discontinued, but I found a good shade for me and the only one left. I have been using it for almost a week and have to say that it is performing a bit better than all the other concealers I have used over the year and there have been many!  I say a bit because the under eye lines still end up a bit noticeable, but it is not breaking up like the others and making my eyes look crepey.  I do not set it with loose powder, but finishing and very lightly because it is shiny if I dont.  thankfully it does not look weird with powder either.The coverage is good and last all day. I am almost 45 so getting a decent concealer has been a struggle. Glad this one looks lovely", "I love this product.  I put a single line under my eye and blend in the entire eye area with a damp beauty sponge.  I have used skin oil underneath as a primer but you honestly don't need too.  I have set with setting spray and let dry.  I never use powder under my eyes and this seems to help as well.  Never has creased on me when every concealer I have used before has creased badly.", "Creases right away, and is overly thick. Is also to greasy to use as an eyeshadow base. Preferred the makeup revolution concealer as a dupe for shape tape", "It leaked and I had to return it! The formula was super nice and I originally tried a sample that made me want to get it. It was such a shame that it just leaks right though! DON'T LAY IT DOWN IF YOU HAVE TO BUY IT! Like a cheap design...it doesn't change. It will keep leaking after you open it because the air pressure and design. I really never expected that from Tarte. The concealer itself was good. Why not put it in a tube?", "When testing concealers that would cover my undereye circles without emphasizing my fine lines. I found this gem. Lots of colors and tones to choose, easy to use, and covers well with just a little bit! A dab goes a long way and I found a touch of setting powder keeps it in place all day long.", "For the price I paid for this I would not buy it again. It was just as if I bought a cheap brand. It looked great for about 2 hours, but then I noticed my face started to feel oily. I checked and sure enough it was extremely shiny every where I applied it. I even used a matte finish and matte setting spray which usually does the trick for at least 6 hours or so. I was very disappointed with this product as it was so expensive."], "date": ["5 Sep 2018", "3 Oct 2018", "17 Aug 2018", "26 Jul 2018", "27 Jul 2018", "9 days ago", "15 days ago", "16 days ago", "16 days ago", "23 days ago", "24 days ago", "29 days ago", "1 month ago", "1 month ago", "1 month ago"], "score": [1, 3, 5, 5, 4, 5, 4, 4, 2, 4, 5, 1, 2, 5, 1], "title": ["Terrible packaging", "Creases and Creates Unwanted Texture", "Great for dry skin", "IF YOU DON'T LIKE THIS PRODUCT, TRY USING LESS..", "Thought it had some promise.....", "Be patient", "Really like the coverage", "New Holy Grail Concealer!", "False Advertisement", "glad I found a shade last minute!", "Works amazing for me", "Don't buy", "Bad applicator and design", "It does not crease!", "Not a fan."]}, "figure_URL": ["https://www.sephora.com/productimages/sku/s2094548-main-grid.jpg", "https://images.ulta.com/is/image/Ulta/2530006?$md$"], "id": 227, "mini_figure_URL": ["https://www.sephora.com/productimages/sku/s2094548-main-grid.jpg", "https://images.ulta.com/is/image/Ulta/2530006?$md$"], "name": "Creaseless Under Eye Concealer", "price": 26.0, "review_score": 3, "source": {"original_price": [26.0, 26.0], "product_URL": ["https://www.sephora.com/product/creaseless-concealer-P433206?icid2=products grid:p433206:product", "https://www.ulta.com/creaseless-undereye-concealer?productId=xlsImpprod18541028"], "source": ["Sephora", "UTLA"]}}