{"brand": "Dior", "comment": {"content": ["I love lip scrubs but always find myself hating that I have to dig my fingers in a pot of product and get the grit under my nails and bacteria in the jar.  This is a fine scrub, it does leave my lips feeling smooth but it doesn't have the same granular sugar found in many others.  Therefore, it might not give you as \"rough\" an application as some like. This has a soft minty smell. Overall I love this product for the ease of use, portability, and hygienic packaging.", "I'm a little bit addicted to this. It works really well, feels a step above most lip scrubs and is really convenient compared with those applied by hand. I am not convinced that it works that much better than other lip scrubs to justify the price.", "I absolutely adored the original Lip Glow. I honestly felt as if every other lip product paled in comparson until I found this ingenious lip balm/scrub hybrid.  The texture is silky and luxurious while the scent is sugary but not cloying. I find that the scent is less than the actual Lip Glow. I also found that the formula is less tacky. Overall it's a phenomenal, decadent product that will make your heart swoon.", "Not as moisturizing as the Dior Addict Lip Glow Color Reviver Balm but it's good for warm/hot days. The scrub feels gentle but works. More convinient than those scrubs that require fingers to apply.", "While it does an awesome job at moisturizing and hydrating my lips coupled with a light dose of exfoliation this product is outrageously overpriced for the amount of product you get. If I use this everyday I can definitely see myself needing a replacement after a month. But since it's doing such an awesome job I do see myself repurchasing despite the price tag.", "My lips feel more hydrated and smoother after using this balm! It also leaves a nice flushed pink tint as well which I love."], "date": ["8 Feb 2017", "15 May 2017", "12 Jan 2017", "26 Apr 2017", "24 Feb 2017", "15 Mar 2017"], "score": [5, 4, 5, 4, 5, 5], "title": ["Finally a scrub not in a pot", "Love It", "Light Fragrance And Lovely Texture", "Like it", "Very Little Product", "amazing"]}, "figure_URL": ["https://www.sephora.com/productimages/sku/s1916857-main-grid.jpg"], "id": 246, "mini_figure_URL": ["https://www.sephora.com/productimages/sku/s1916857-main-grid.jpg"], "name": "Dior Addict Lip Sugar Scrub", "price": 34.0, "review_score": 4, "source": {"original_price": [34.0], "product_URL": ["https://www.sephora.com/product/dior-addict-lip-sugar-scrub-P416366?icid2=products grid:p416366:product"], "source": ["Sephora"]}}