{"brand": "Yves Saint Laurent", "comment": {"content": ["Undeniably the best formula of lipsticks I’ve ever used. First of all, it has an incredible peach/mango taste which I adore! The formula is like putting butter on your lips, it is not like a lip gloss at all, it is definitely a intense moisturizing oil with a beautiful color. This also has an amazing plumping effect. Yes, it is pricey for a lipstick, but SO worth it. Nothing compares to this lipstick and I’ve never tried anything near this amazing.", "I don't have dry lips, but I don't like dry lip sticks. I have tried a lot of other luxury brands, but I keep coming back to YSL. This is a prefect every day lip stick. It is as moisturizing as a lip balm, but at the same give just enough color for a natural office makeup. I was looking for a good orange red color and 46 is just perfect for my Asian skin tone. The color lasts me a few hours with/without drinking. I don't think it will last through a heavy meal, light salad might be ok. I personally always wipe off my lipstick before I eat (not a big fan of eating cosmetics), so to me it is more important finding a moisturizing lipstick than one that lasts a long time. It has a very light pleasant scent that doesn't bother me at all. Absolutely love the formula and will buy more shades.", "This lipstick is my go-to lippie. The color Rouge in Danger is a gorgeous red that fades to a strawberry color. It is very moisturizing. One thing I love is that even when it fades it is forgiving and still looks good on my lips. And I have yet to find an all-day product that doesn't get flakey or results in a lipliner only effect. When I do re-apply it goes on smoothly and looks great (another issue with matte or longwear lip products).", "So I told myself that I would never spent $35 for a lipstick. Bought one (Brun Insecure) and automatically KNEW that I would be getting another (Chocolate Instyle)! They are the most moisturizing lipsticks I've ever owned. I find myself constantly pressing my lips together just because they feel so soft! They are not opaque, the two that I own, which is great. Somewhat sheer, but still pigmented and natural looking, they remind me of the Revlon Lip Butters (which I love and own so many of) but so much more... amazing? I don't know what else to say about them, but I know that the next one that I get will be that dark purple shade that I keep eyeballing. I don't think you would regret getting one of these. :-)", "I'm not a huge lipstick person but got this because I saw it in Lisa Eldrige's bright lipstick video. The packaging is amazing, it makes me feel special every time I use it. The color is bright but I feel anyone can pull it off. To make it last longer, I blot the first coat and then reapply. It lasts forever without drying out your lips, which tends to happen to me with other lipsticks. I am so happy with this purchase!", "I have dry lips every day and this shine outperforms it's competitors... Chanel coco shine and Dior lip addict. Both Chanel and Dior dried my lips and cracked into the dry parts. YSL goes on and stays on like butter. It's so hydrating and I love the colors!!"], "date": ["27 Jan 2018", "13 Dec 2017", "1 Oct 2017", "13 Oct 2014", "29 May 2013", "4 Nov 2014"], "score": [5, 5, 5, 5, 5, 5], "title": ["Holy grail of lipsticks", "color 46 - perfect orangy red", "My default lipstick", "In Loooooove!", "a treat", "Luxurious creamy lip!"]}, "figure_URL": ["https://www.sephora.com/productimages/sku/s1811520-main-grid.jpg"], "id": 239, "mini_figure_URL": ["https://www.sephora.com/productimages/sku/s1811520-main-grid.jpg"], "name": "Rouge Volupt Shine Oil-In-Stick Lipstick", "price": 38.0, "review_score": 4, "source": {"original_price": [38.0], "product_URL": ["https://www.sephora.com/product/rouge-volupte-shine-oil-in-stick-lipstick-P377710?icid2=products grid:p377710:product"], "source": ["Sephora"]}}