{"brand": "MILK MAKEUP", "comment": {"content": ["I bought this because it seemed so multifunctional & I really like it! It puts a nice & soft tint on my lips as well as well. The formula also smells good too which takes it enjoyable to apply.", "This product renewed my belief I could actually use blush on my skin tone. Most blushes I have tried, immediately disappear. Pigment does not show well on my skin for some reason, but this is beautiful. It leaves a nice, natural glow that I love as I do not wear a lot of makeup and prefer more of a natural look. I set it with a translucent powder after applying straight from the tube and then gently blending with my beauty blender. Have also used it as an eyeshadow and that looks gorgeous as well. I don't prefer to use it on my lips as it doesn't stay and it feels funny. Great product.", "I bought this in Berry, I should probably get it in peach also. It's a more moisturizing type of \"all over\" stick similar to the NARS multiple. I loved the way it melted into my cheeks and the way it pigmented my lips. \r\n\r\nMy reason for giving it 4 stars is two fold: First, on my lips it was - well not greasy- but glossy to the extent that it highlighted the fact I really needed to exfoliate my lips. It just sat on top of my lips without hydrating them. Most lipsticks or even my NARS multiples collection will cover up the little unevenness in my lip texture but this paraded it! That was a bummer- so i took it off and then exfoliated my lips, put on a balm and then put it on- much better. FYI. SECOND- it's gigantic! Like a huge product. It's not purse size and even for the gym it takes up more space than anything else I have.. this is only for lips and cheeks- why so large? I swear it's like 3 +inches in diameter and 4 inches tall. It's the equivalent of taking 3 NARS multiples and rubberbanding them together. \r\n\r\nBut whatever ,it looks cool, so I'm keeping it.", "I had been looking for a multi-tasking lip and cheek product that I could pop in my purse and this is absolutely perfect! I love the Perk color; it gives me just the right amount of glow and blends seamlessly with the Suntint product.", "The only shade worth buying in this line is Quickie -- while the name is not great the berry purple is amazing. For a gel blush, this had great color pay off! The application is also super handy, and great to carry around in your purse. It has been a staple in my summer makeup routine. The one thing I would say it that it doesn't last very long -- even with setting powder, it only lasts about a few hours."], "date": ["12 May 2018", "18 Apr 2017", "28 Feb 2017", "21 Sep 2016", "17 Aug 2016"], "score": [5, 4, 4, 5, 4], "title": ["multifunctional", "Blush believer again", "Great combo", "Love it!", "Great Berry Color!"]}, "figure_URL": ["https://www.sephora.com/productimages/sku/s2062446-main-grid.jpg"], "id": 240, "mini_figure_URL": ["https://www.sephora.com/productimages/sku/s2062446-main-grid.jpg"], "name": "Lip + Cheek", "price": 14.0, "review_score": 4, "source": {"original_price": [14.0], "product_URL": ["https://www.sephora.com/product/lip-cheek-P404799?icid2=products grid:p404799:product"], "source": ["Sephora"]}}