{"brand": "CHANEL", "comment": {"content": ["I really like this lipstick because it stays well and feels good when you put it on.", "Love this natural color. It is not bold. It is a light matte color.", "The color is perfect, it's so pretty! and I will buy one for my friends as a birthday gift!", "I was looking for a lipstick color to go with a dress I bought for a wedding, which is Rose Gold. The color I bought went perfectly. This lipstick is also nice for everyday use. The only thing I don't like is that it does not stay on and you will need to re apply often.", "I really love this lipstick! It lasts for a very long time while maintaining its beautiful color. I love using it because it’s a very useful color! This Chanel lipstick is worth buying for!", "I love, love, love this. It is worth every penny. I want to stock pile it for when it is no longer sold.", "I order 40 La Sensuelle Rouge Allure Velvet but when I received lipstick that is total different color on Macy’s Website. And then I checked on Chanel website that is different too. So be disappointed!", "I like it make me a beautiful lip and smile................................................"], "date": ["10/06/18", "07/18/18", "05/15/18", "04/08/18", "04/13/18", "04/06/18", "03/19/18", "01/05/18"], "score": [5, 5, 5, 4, 5, 5, 1, 5], "title": ["Great lipstick", "Matte brownish pink", "perfect color", "Nice color", "Best Lipstick!!", "Worth it", "Different color", "Best"]}, "figure_URL": ["https://images.bloomingdalesassets.com/is/image/BLM/products/0/optimized/9746480_fpx.tif?$2014_BROWSE_FASHION$&hei=350&wid=280"], "id": 388, "mini_figure_URL": ["https://images.bloomingdalesassets.com/is/image/BLM/products/0/optimized/9746480_fpx.tif?$2014_BROWSE_FASHION$&hei=350&wid=280"], "name": "ROUGE ALLURE VELVET Luminous Matte Lip Colour, Spring-Summer Makeup Collection 2018", "price": 37.0, "review_score": 4, "source": {"original_price": [37.0], "product_URL": ["https://www.bloomingdales.com/shop/product/chanel-rouge-allure-velvet-luminous-matte-lip-colour-spring-summer-makeup-collection-2018?ID=2844150&CategoryID=2921"], "source": ["Bloomindale"]}}