{"brand": "Este Lauder", "comment": {"content": ["I've been using this foundation since I was 15. I love it so much. It covers everything, stays put, and looks so beautiful and flawless on the skin. I wore it for around 30 hours once (don't do this) and it still looked pretty decent with a few touchups. I can sheer it out or really build it up depending on what look I want. This is the only liquid foundation I ever reach for. Only complaint is that I wish it came with a pump. Spending a $10 extra for one just seems like a waste.", "I have been using Estee Lauder double wear foundation for years with good results. It provides good coverage and as the name indicates, it stays in place and does not degrade over the course of the day.", "This foundation doesn't even compare to any other foundation I've tried. It looks natural but has wonderful coverage! Stays all day long and doesn't oxidize or cause my skin to break out!", "This foundation is hands down one of the best foundations out there . Personally i like to use it as my everyday foundation because it lasts really long and has the most beautiful natural matte finish . Im not usually a fan of matte foundations because they tend to dry me out too much and make me look flat so this is the only matte foundation i wear and i love it . Definitely would recommend trying it . I just wish it came with a pump but i can live past that :)", "I purchased this product for the second time in the color sandalwood. It is medium to full coverage, it is totally up to how much product you use. I love the coverage and it is a perfect match for my skin. I do get a little oily in my t-zone in the middle of the day but I just use powder for touch ups. It's one of the best foundation for full coverage.", "I'm 21 years old with severe hyper pigmentation due to years of acne. I'm in the shade honey bronze (NC42 and L'Oréal infallible 108 for reference). I have extreme combo skin in where my tzone is very oily but my chin and cheeks are super dry and flaky. This foundation has amazing coverage and works well with my combo skin. I find that the shade matched me extremely well and is very similar to the infallible foundation. The difference is the consistency. The infallible is a lot heavier and thicker. The double wear foundation is runnier than what I expect from a full coverage foundation. A little goes along way which is great. It gives off a satin matte finish rather than completely matte. I tried it with a beauty sponge and wasn't a fan. You can cake this foundation but not as bad as other full coverage foundations on the market. I didn't have an issue with it oxidizing. Unlike the infallible, the double wear doesn't separate so it wears well through out the day. I'd say it lasts about 4 hours before I have to blot but the foundation doesn't budge or rub off when I do. I've worn this up to 9 hours blotted twice and by the end of the night the foundation still looked great. Minimal retouching. I recommend using a rich moisturizer, smoothing primer and exfoliater (murad skin polish)  because it can enhance any uneven texture on the skin."], "date": ["18 Mar 2018", "4 May 2014", "27 Jun 2016", "16 Feb 2016", "30 Jan 2016", "12 Mar 2017"], "score": [5, 5, 5, 5, 5, 4], "title": ["Classic. Beautiful. Holy Grail.", "Execllent liquid foundation", "Natural, Glowing skin!", "holy grail", "One of my favorites", "will be repurchasing"]}, "figure_URL": ["https://www.sephora.com/productimages/sku/s2112167-main-grid.jpg"], "id": 3, "mini_figure_URL": ["https://www.sephora.com/productimages/sku/s2112167-main-grid.jpg"], "name": "Double Wear Stay-in-Place Foundation", "price": 42.0, "review_score": 4, "source": {"original_price": [42.0], "product_URL": ["https://www.sephora.com/product/double-wear-stay-in-place-makeup-P378284?icid2=products grid:p378284:product"], "source": ["Sephora"]}}