{"brand": "Giorgio Armani Beauty", "comment": {"content": ["Super small. Didn’t realize just how small it would be but works great!", "This foundation is amazing, it gives me a flawless, glowy, healthy finish. I have been trying to find a foundation that works for me, I believe this is it, I wish I would have found it sooner! If I don't feel like going dewy I apply a little coty airspun loose powder on top, and it's the best combo. I have dry to normal skin with some red spots on my cheeks, it covers it!", "This goes on like silk - have older dryer skin and it just slides on so nicely and leaves a flawless look", "I have normal to dry skin and hyperpigmentaion. This foundation is medium coverage. What I like the most is how natural this looks on the skin. It does not settle into any fine lines and does not emphasize dryness. I wish the lasting power was better (4 hrs).", "Received a sample of this foundation and was pleasantly shocked to find the color was a perfect match and the finish was silky smooth. Although this seems to be a highly pigmented foundation, the coverage is medium rather than full. Buildable? Yes, however using a single application with a good spot concealer will provide an incredibly natural, seemingly flawless finish. Purchased the mini size to see me through the winter months and will probably find a slightly warmer shade for the summer months.", "I have combination skin and minimal acne. This foundation has the perfect amount of coverage, as I am in high school and don’t need heavier makeup. I wouldn’t recommend if you have severe acne or a lot of blemishes, as this product is a more sheer finish. It is a GORGEOUS foundation that is super light on the skin and is perfect for me!"], "date": ["6 Dec 2017", "19 Mar 2018", "17 Feb 2018", "27 Nov 2017", "25 Feb 2018", "12 Aug 2018"], "score": [4, 5, 5, 4, 5, 5], "title": ["pretty good", "My new Holy Grail foundation", "The Best of the Best", "medium coverage", "Produces a lovely, natural look!", "great for those looking for minimal sheer coverage"]}, "figure_URL": ["https://www.sephora.com/productimages/sku/s1803147-main-grid.jpg"], "id": 33, "mini_figure_URL": ["https://www.sephora.com/productimages/sku/s1803147-main-grid.jpg"], "name": "Luminous Silk Foundation Mini", "price": 42.0, "review_score": 4, "source": {"original_price": [42.0], "product_URL": ["https://www.sephora.com/product/luminous-silk-foundation-mini-P425938?icid2=products grid:p425938:product"], "source": ["Sephora"]}}