{"brand": "Yves Saint Laurent", "comment": {"content": ["I love the color of this lip stain! It glides on well and the applicator is AMAZING. The formula is awesome and not too sticky. My only complaint is that when I went to eat, I really tasted the product and it was very plasticky.", "First I have to say colors 402 and 411 are basically the same color – I really can’t tell the difference.  These are probably the only tint I’ve ever used that has such a long lasting tint.  The shine of the gloss lasts though drinking and light eating but comes up when you eat food requiring your mouth being wiped.  But the color on your lips will remain for a very long time – basically all day.  I’m really pleased with this product – I bought 3 shades.", "I absolutely love this stain. It lasts and lasts and doesn't dry my lips out at all. It has a nice smell and a very comfortable applicator.", "BUY it when the 407 is in stock again! Please do! It is so pretty no matter you do it all over or blend it with your finger. What is so special about this color is that it actually shows different color on everybody. My friend and I have different color with this and it just fits us so well. SATISFIED!", "I absolutely love this product, and have been wearing it almost every single day since I received it!! The color is gorgeous (412) & long lasting.  It is also very comfortable to wear/feels creamy & moisturizing and is not drying at all!! I would definitely recommend this product, and I will be purchasing more colors!! :)", "Super lightweight, yet long lasting and strong coverage! I love all YSL lip products. This line just becomes my new fav"], "date": ["7 Sep 2016", "17 Oct 2016", "20 Sep 2017", "22 Feb 2017", "1 Oct 2016", "18 Mar 2017"], "score": [4, 5, 5, 5, 5, 5], "title": ["great product!", "Love it!", "Perfect lip stain", "407 !!!", "LOVE", "love it"]}, "figure_URL": ["https://www.sephora.com/productimages/sku/s1858042-main-grid.jpg"], "id": 478, "mini_figure_URL": ["https://www.sephora.com/productimages/sku/s1858042-main-grid.jpg"], "name": "Vinyl Cream Lip Stain", "price": 37.0, "review_score": 4, "source": {"original_price": [37.0], "product_URL": ["https://www.sephora.com/product/rouge-pur-couture-vernis-l-vres-vinyl-cream-P410743?icid2=products grid:p410743:product"], "source": ["Sephora"]}}