{"brand": "Yves Saint Laurent", "comment": {"content": ["I have never had a lipstick like this, I tried it after a review I red andI said it's expensive but I try it. It's the only way I find out. It's trulyamazing,it improves the condition of the lips, once the color is gone.And it takes a long time to actually dissapear, and it does not leavelips wrinked like some. I even tried another YSL and its nothinglike this one. This one is increidble better. It's the lipstick you wantif you want loud colors, not for the timid or someone who does notwant attention in their liips.", "I ordered this lipstick because I already tried the Rouge Volupte ones. This lipsticks are just amazing, the texture, the color, the package, they are simply perfect, plus they last a little bit longer than the Volupte which are also perfect!", "The best lipstick and texture is on point. Doesn't get dry and cakey. Leaves your lips moist and color stays on almost all day. I would definitely recommend this all who want the best on their lips.", "make sure you buy it in the store unless you're reordering one you already have.", "This lipstick looks NOTHING like it does on the website. It is a bright orange based pink and looks terrible when applied. It also has a pungent chemical smell that does not dissipate. I am very unhappy with this purchase and will no longer be buying anything from the website. I will have to go to a store where they sell it to see the colors firsthand IF I choose to buy and YSL makeup again, which is highly unlikely.", "I have used many other lipsticks but nothing beats YSL mats lipsticks. It's easy to apply and stays on for hours. It doesn't feel like wearing lipsticks when I have it on. And it also doesn't leave you feel chapped or flaky like other brands. Received so many compliments every time I wear it. I have #203 and #211. And tempting to get #214 and #217. [This review was collected as part of a promotion.]", "I would 100‰ recommend this product! I was looking for a matte lipstick for a while and once I tried it I couldn't let it go. I've been using it for a while now, it stays beautifully for hours and it's perfect whether you want to use it for a night out or just as a daily product. It gives you that little extra confidence that we all need when we step out of the door.", "I ordered #212 alternative plum..its stunning! I receive so many compliments when i wear it ( basicly all the time). Its matte and it does not dry my lips out at all! YSL is the best! There is just something special pulling that beautiful lipstick out of your purse, YSL gold tube shining and your name engraved on it! LOVE IT!!!!!!"], "date": ["04/08/11", "06/06/16", "10/26/15", "02/13/12", "01/01/17", "12/29/16", "12/28/15", "12/07/16"], "score": [5, 4, 5, 5, 1, 5, 5, 5], "title": ["The Best lIpstick You Will Ever Need !!", "Love it!", "YSL lipstick", "very nice lipstick", "Awful. Neon Orange-ish Pink not 'Decadent Pink'", "Best lipstick in the world", "Perfect!", "PERFECTION!"]}, "figure_URL": ["https://images.bloomingdalesassets.com/is/image/BLM/products/0/optimized/9201670_fpx.tif?$2014_BROWSE_FASHION$&hei=350&wid=280"], "id": 494, "mini_figure_URL": ["https://images.bloomingdalesassets.com/is/image/BLM/products/0/optimized/9201670_fpx.tif?$2014_BROWSE_FASHION$&hei=350&wid=280"], "name": "Rouge Pur Couture", "price": 38.0, "review_score": 4, "source": {"original_price": [38.0], "product_URL": ["https://www.bloomingdales.com/shop/product/yves-saint-laurent-rouge-pur-couture?ID=501751&CategoryID=2921"], "source": ["Bloomindale"]}}