{"brand": "Yves Saint Laurent", "comment": {"content": ["I received this product for free through Influenster and love it! I received Code Red Black. It's vibrant and highly pigmented and glides but on like a dream. The color is long lasting but does transfer. Love it.", "I have a small collection of these now and I must say they are SO GOOD. They’re literally the perfect combo of a stain and liquid lip. It’s unlike anything I’ve ever tried and I’ve tried a million liquid lipstick and all of them have been just ok or less. These are matte yet very moisturizing and pigmented. They truly feel like there is nothing on your lips, it’s so weird! Anyway I am a big fan and I plan on getting more and won’t be buying any other brand in the near future.", "New favorite liquid lip! Feels like nothing, not drying and the application makes it so easy to apply without using a lip liner, 7 NU INTERDIT - medium nude is the perfect natural lip color for my lighter skin tone and i will definitely being purchasing more colors", "Such a gorgeous, gorgeous shade. It's deep but almost like a true berry. A very unique shade that looks great against my deep skin. Can wear in both fall and spring/summer. It wears and fades nicely and lasts for a LONG time. Gave it 4 starts because it has a strong perfumey smell when you first apply it. It goes away, but its a bit much for a lip product. But it's worth the price..doesn't make your lips all dry/flaky and like you have nothing on!", "I love this product! The color is charming! And it can last for a time even I can’t stop to drink (^^) [This review was collected as part of a promotion.]", "I got this product as a sample from Sephora in color #5 and I love it! Superb rich color that lasts. Great selection of colors...I’ll be buying more! [This review was collected as part of a promotion.]", "I have some hyperpigmentation on my skin and I am medium to dark skin tone. Color 23 looks almost skin like on me and it’s so comfortable to wear.", "Best matte lipstick on the market! I loved it so much I bought it for all my friends [This review was collected as part of a promotion.]", "Why is #25 always sold out? Everytime I get an notification that it is back in stock, it’s gone again....This shade is very popular and it gets out of stock very fast. I strongly suggest to make this color in a big lot so we can have the opportunity to own one and avoid people from reselling at higher price.", "bought this about two month ago and love it. I bought a couple more from this collection and love them all", "this color is wonderful! I love it so much. I am so happy to have it. [This review was collected as part of a promotion.]", "I’m so happy with this,and it looks really good on my lips!! [This review was collected as part of a promotion.]"], "date": ["21 Sep 2017", "28 Feb 2018", "25 Sep 2017", "19 Oct 2017", "12/04/18", "12/01/18", "12/01/18", "12/02/18", "11/27/18", "11/23/18", "11/22/18", "11/21/18"], "score": [4, 5, 5, 4, 5, 5, 5, 5, 1, 5, 5, 5], "title": ["Great texture", "bomb.com", "Gorgeous and unique shade!", "Beautiful and a bit drying", "Awesome lip stain!!", "Received a sample...", "Most comfortable lip product ever", "Love!", "Sold out", "Best color", "best purchase ever!", "Really beautiful color"]}, "figure_URL": ["https://www.sephora.com/productimages/sku/s2121234-main-grid.jpg", "https://images.bloomingdalesassets.com/is/image/BLM/products/8/optimized/9622698_fpx.tif?$2014_BROWSE_FASHION$&hei=350&wid=280"], "id": 479, "mini_figure_URL": ["https://www.sephora.com/productimages/sku/s2121234-main-grid.jpg", "https://images.bloomingdalesassets.com/is/image/BLM/products/8/optimized/9622698_fpx.tif?$2014_BROWSE_FASHION$&hei=350&wid=280"], "name": "Tatouage Couture Liquid Matte Lip Stain", "price": 37.0, "review_score": 4, "source": {"original_price": [37.0, 37.0], "product_URL": ["https://www.sephora.com/product/tatouage-couture-matte-stain-P423327?icid2=products grid:p423327:product", "https://www.bloomingdales.com/shop/product/yves-saint-laurent-tatouage-couture-liquid-matte-lip-stain?ID=2713057&CategoryID=2921"], "source": ["Sephora", "Bloomindale"]}}