{"brand": "Yves Saint Laurent", "comment": {"content": ["Love love love. I have Undress Me Coral and just got Grab Me Red. The feel is not too slick and wears off with a nice tint.", "This is my first time using Yves Saint Laurent Volupte' Liquid Color Balm and it surely won't be the last! Packaging/appearance is some of what draws me to a product, than it's the product itself. The smell is remarkable! The consistency of the balm is smooth and isn't sticky and the shine is perfect. \n\nOverall this is one of the best i have had the balms i have used. Thank you influenser for introducing me to now, one of my go-to balms!  Yves Saint Laurent Volupte Liquid Color Balm", "Con: doesn’t stay orange, fades into a darkish coral color. Still pretty, but not the orange I wanted. I swatched this in store but didn’t put it on. I’d recommend trying it on at your local Sephora before buying to make sure you like the color. \nPros: I’m keeping it anyway, I love how this feels! Comfortable and not drying. Not as glossy or sticky as lipgloss, and sets down to a balm texture after a few minutes. Applicator is a great shape to line lips (diamond shape) so I don’t need to use liner. Gorgeous packaging! Screws then snaps shut. I plan on getting more shades for sure", "i haven't written a review in a long time, but i can say that i am ABSOLUTELY shocked by this product! i am not a fan of lip glosses-- i find them sticky and gross since they ball up on the lip and are uncomfortable. this is the perfect summer, glossy hydrated lip that you want. trust me, it's one-swipe coverage and makes your lips look so juicy and full! in 2018 i swore off matte liquid lipsticks and have only been purchasing bullet lipsticks (aside from YSL tatouage ones which is another fave) but this gladly makes me break my no-buy for liquid lip products! also can we just mention how this is a BALM? it quite literally feels like nothing on the lips or like you applied a good layer of your favourite lip balm. absolutely no complaints and if the colours were more my speed i would pick up more -- maybe #12 later on but #11 is perfect in terms of giving my pigmented lips a burst of berry colour. this will be on my lips all summer long! i bought this on my own at full price and will not stop raving :')", "Love the color and the formula is amazing. Doesn’t leave my lips dry and the color lasts for a couple of hours. Packaging is also cute. I received this product for free for testing purposes."], "date": ["5 Jul 2018", "4 May 2018", "16 May 2018", "28 May 2018", "19 May 2018"], "score": [5, 5, 4, 5, 5], "title": ["My go to Yves Saint Laurent Volupte Liquid", "Not true to color, but still gorgeous", "YSL knocks it out of the park yet again", "Love", "Good overall"]}, "figure_URL": ["https://www.sephora.com/productimages/sku/s2038560-main-grid.jpg"], "id": 487, "mini_figure_URL": ["https://www.sephora.com/productimages/sku/s2038560-main-grid.jpg"], "name": "Volupt Liquid Color Balm", "price": 32.0, "review_score": 4, "source": {"original_price": [32.0], "product_URL": ["https://www.sephora.com/product/volupt-liquid-color-balm-P430703?icid2=products grid:p430703:product"], "source": ["Sephora"]}}