{"brand": "Benefit Cosmetics", "comment": {"content": ["Been looking for a brow pencil since MAC changed it formula and packaging on their brow pencil. This pencil glides smoothly and is the perfect color for me.", "This product was highly recommended by my friends. I was sceptical about the price but I got a great deal in the VIP sale. All i can say now is WOW WHERE HAVE YOU BEEN ALL MY LIFE?! My natural eyebrows are thin so i have to overdraw them but this pencil makes it look like my real hair! No instagram effect. Just beautiful brows.", "I have tried so many brands, but this is the one I keep reordering.", "Im new to the whole Brow trend so I thought Ide go with a well reviewed product.", "I’ve had this eyebrow pencil for a long time. I’ve tried other brow pencils, but this a winner.", "Great for thin strokes and lasts a long time! No need to reapply!", "nice fine line for filling thin brows especially for getting good shape. pencil comes in good range of shades", "If you want your brows to look natural after using a brow pencil this is the one for you. After chemo my brows become lighter in color and less full. I finally found a good color fit and a pencil that is very fine, allowing me to fill in with a feather stroke that provides good color and they appear natural."], "date": ["12/07/18", "10/26/18", "09/21/18", "04/02/18", "07/08/18", "06/01/18", "05/23/18", "04/13/18"], "score": [5, 5, 5, 3, 5, 5, 5, 5], "title": ["Love this brow pencil", "The Mercedes-Benz of eyebrow pencils", "Best brow pencil", "new to Brow stuff", "A winner!!!", "Benefit Precisely My Brows", "Nice Pencil", "Finally Found a Brow Pencil I love"]}, "figure_URL": ["https://images.bloomingdalesassets.com/is/image/BLM/products/6/optimized/10122996_fpx.tif?$2014_BROWSE_FASHION$&hei=350&wid=280"], "id": 499, "mini_figure_URL": ["https://images.bloomingdalesassets.com/is/image/BLM/products/6/optimized/10122996_fpx.tif?$2014_BROWSE_FASHION$&hei=350&wid=280"], "name": "Precisely, My Brow Pencil", "price": 24.0, "review_score": 4, "source": {"original_price": [24.0], "product_URL": ["https://www.bloomingdales.com/shop/product/benefit-cosmetics-precisely-my-brow-pencil?ID=3190847&CategoryID=2921"], "source": ["Bloomindale"]}}