{"brand": "Yves Saint Laurent", "comment": {"content": ["very lip product from ysl leaves a beautiful stain on my lips. Man, how do they achieve that? that's incredible. can't have enough.", "If you're not down for the commitment of a lipstick, but wearing lipbalm only enhances your colorless, lifeless lips? Look no further! YSL has got a product for you! Say goodbye to pale lips and hello to normal looking, slightly tinted, lips that look full of life! No it is not kissproof, or drink proof, but! It will surely hydrate your lips while giving you an extra boost of colour! I enjoy this product a lot, my first product from YSL and I'm impressed!", "Great tint, texture, and smell. These are like an oil consistency, and have a great staying power. Very lightweight and comfortable to wear. Love!!!", "I absolutely love this tint in balm. It is completely worth the price. The packaging is outstanding and the one I bought ( #4 ) has great pigmentation. This product looks very high quality when in use.", "ok, this is just a balm. It smells awesome, it's moisturizing, it leaves a nice tint on the lips. Annabelle's lipsies do the same thing for a fraction of the price but still.. I love this product. It feels luxurious, it does a great job to keep lips smooth. I will keep mine and will replace it when it's finished!", "This is my holygrail of lip color! It actually is soothing and moisturizing and my lips stay tinted for a few hours. If you are a fan of a fully made-up lipstick look, this may not be for you.", "I choose color #9, and it appears lighter than in the picture, but I still like it! [This review was collected as part of a promotion.]", "I bought this on a whim when I was looking for a new lipstick. I never buy with out trying the color first but I was intrigued that this conditioned and provided color all in one so I went for it. It is amazing. I am not only looking to buy another two shades for myself, but am also planning on getting one for my Mom and Sister. Truly a revelation. Do not hesitate, they are discontinuing and this is a real gem!", "Love this lip tint, feels super luxurious and the smell is amazing!", "I bought it for months ago. It’s the first time I use YSL lipstick. I really like it. It is so moisture. [This review was collected as part of a promotion.]", "YSL VOLUPTE TINT IN BALM feels like a dreamy kiss! Smooth and Soave, and gently nourishing with pure mango oil; a glow and a tint; a bit of daytime dash and color for in the go!", "I am so in love with this tint-in-balm. I love the color, scent, look, everything about it and I highly recommend it!", "I already bought it few times. It's really good. I will keep buy more things. Recommend!!! [This review was collected as part of a promotion.]", "I love how it moisturizes and adds color at the same time. The lip shape in the center is a great touch. Engraving and casing is beautiful"], "date": ["29 May 2017", "23 Jun 2017", "1 Apr 2017", "29 Apr 2017", "23 Jun 2017", "11 Oct 2017", "12/06/18", "11/28/18", "12/02/18", "11/29/18", "11/27/18", "11/24/18", "11/10/18", "10/31/18"], "score": [5, 5, 4, 5, 5, 5, 4, 5, 5, 5, 5, 5, 5, 4], "title": ["Lov it, anyone knows the pink-haired girl from ad?", "My Lips But Better!", "gorgeous balm", "amazing", "Expensive balm but... I LOVE it!!!", "Absolutely love!", "The color is great but not as expected", "My first purchase and I am in love!!", "super luxurious", "My best purchase", "Delicious lips", "Amazing", "Top one ysl lip makeup", "Great for the fall/winter"]}, "figure_URL": ["https://www.sephora.com/productimages/sku/s1919729-main-grid.jpg", "https://images.bloomingdalesassets.com/is/image/BLM/products/1/optimized/9416061_fpx.tif?$2014_BROWSE_FASHION$&hei=350&wid=280"], "id": 481, "mini_figure_URL": ["https://www.sephora.com/productimages/sku/s1919729-main-grid.jpg", "https://images.bloomingdalesassets.com/is/image/BLM/products/1/optimized/9416061_fpx.tif?$2014_BROWSE_FASHION$&hei=350&wid=280"], "name": "Volupt Tint-in-Balm", "price": 34.0, "review_score": 4, "source": {"original_price": [34.0, 34.0], "product_URL": ["https://www.sephora.com/product/volupte-tint-in-balm-P417850?icid2=products grid:p417850:product", "https://www.bloomingdales.com/shop/product/yves-saint-laurent-volupte-tint-in-balm?ID=2536483&CategoryID=2921"], "source": ["Sephora", "Bloomindale"]}}