{"brand": "Yves Saint Laurent", "comment": {"content": ["These are the same plastic lipsticks except the packaging is amazing. I love that you can engrave them at no additional cost .", "These are the same classic lipsticks except the packaging is amazing. I love that you can engrave them at no additional cost .", "love the outlook of this lipstick and the premium quality of YSL lipstick as always.", "I have sensitive lips and they get irritated easily so I have not bought any lipstick for like 5 years. Not only the color of the lipstick is nice and it stays, it does not cause me any allergic reaction. Love it.", "I like the texture of the lipstick. It’s semi matte. I like that it stay on for at least 5 hours without touch up. It does come off a bit after drink and eat, but not bad. I have dry lip, so it’s hard to find lipstick that doesn’t dry out my lip. I got it engraved to be a gift. It’s good lipstick compared to the price and quality.", "The color looks so beautiful! And I love the little fireworks engraved on the lipstick", "I bought this for my sister. She currently has platinum blonde hair and olive skin. This color suits her and she loves the formula.", "This is the perfect lipstick. Really pretty fuschia shade that goes on smooth and stays on for hours. I love it!"], "date": ["12/03/18", "12/03/18", "10/23/18", "10/17/18", "09/27/18", "10/01/18", "07/25/18", "04/03/18"], "score": [5, 5, 5, 5, 4, 5, 5, 5], "title": ["Dazzling", "Wonderful product!", "Very pretty edition, a must buy collection!", "My first lipstick in a long while", "Beautiful orange coral lipstick", "love the color", "Great Gift", "Most Flattering Fuschia"]}, "figure_URL": ["https://images.bloomingdalesassets.com/is/image/BLM/products/9/optimized/9609469_fpx.tif?$2014_BROWSE_FASHION$&hei=350&wid=280"], "id": 495, "mini_figure_URL": ["https://images.bloomingdalesassets.com/is/image/BLM/products/9/optimized/9609469_fpx.tif?$2014_BROWSE_FASHION$&hei=350&wid=280"], "name": "Rouge Pur Couture Dazzling Lights Lipstick", "price": 38.0, "review_score": 4, "source": {"original_price": [38.0], "product_URL": ["https://www.bloomingdales.com/shop/product/yves-saint-laurent-rouge-pur-couture-dazzling-lights-lipstick?ID=2713019&CategoryID=2921"], "source": ["Bloomindale"]}}