{"brand": "Too Faced", "comment": {"content": ["this is he best foundation I've used! I got it for summer so I could switch from the heavier tarte Amazonian clay foundation. the consistency is perfect, even just a small amount covers just the right amount and looks natural. thought with this foundation it is VERY important to get the right shade as it can tend to oxidize if you're a bit oiler. will forever repurchase.", "I feel bad about the bad reviews on this product!! It just shows how personal a foundation is to the individual. My skin is a bit dry and this is the only foundation that I've tried, that works!! It doesn't dry my skin out more after an hour of wear and it doesn't settle into my pores causing that reverse freckle effect. It Lay's over my skin perfectly. The colors perfect as well. Color IQ was perfect for me on this one. The one thing I will say is that it can feel a bit greasy, not like real skin, at least not mine, but it looks so good I don't care. It also holds up pretty good for me during intense workout and I teach many hot and sweaty ones like spin. I can't help to use makeup during workouts, face feels naked with some foundation.", "I had high expectations for this foundation after hearing people rave about how amazing this is online, but this is without a doubt one of the WORST foundations I've ever tried. Nonetheless, I'll start off with the good things.\r\n\r\nThe packaging is quite sturdy and the product dispenses easily through the pump. The product blends easily with a beauty blender and a brush.However, there are so many more things about this product I dislike.\r\n\r\nCoverage: This foundation provides high medium to full coverage; personally, I don't find that this product to be buildable, but do notice fuller coverage when applying with a dense brush versus my beauty blender (as to be expected). Large blemishes or deep discoloration will not be masked with this product.\r\n\r\nFinish: When first applied the product looks natural/slightly matte, despite its claims that it provides an oily finish. I've tried this all different types of primers and have consistently found the product to look this way on my skin.\r\n\r\nLongevity: This product is NOT long wearing, in the least bit. After 4 hours, the product starts to break up and pill on my face. If you have oily skin like i do, not only do you need to wear a primer, but you will need to set this product with a translucent powder or setting powder, otherwise the cake up gets even worse.\r\n\r\nTexture: From far away, this foundation looks great, but when looking even semi-closely, it enhances every imperfection on my face from dryness, to pore size, to acne or peach fuzz. Sadly, all of these flaws become more pronounced when using this foundation.\r\n\r\nCake Up: The product looks increasingly cakier as the wear-time increases and settles into pores and other  areas of my face, such as the base of my nose. \r\n\r\nDoes not play well with others: In other words, this foundation does not work well with other products. It is difficult to blend out concealer over this product. Additionally, if this foundation isn't set, it will pull other products and cause blotchy application of blush/bronzer. \r\n\r\nFINALLY: Not quite sure how Too Faced managed to make a product that can simultaneously make the face look both more oily and more dry, but they've done it. If you are someone that likes to use an oil blotter on your face, I would think against purchasing this foundation. Once you've blotted your face, your skin will look less oily, but the product will look drier and more pronounced on your skin. Blotting away the oil makes the product look even less natural and more cakey. In fact, by the end of the day when wearing this foundation, my skin looks slightly haggard, so the claim that it makes skin look more youthful seems completely off-base. \r\n\r\nI wanted to like this product, and I've tried applying it so many different ways and with a variety of bases and setting sprays and powders, but this does not mesh well with my skin type and skin texture.", "I wear this foundation with the Hangover primer. I have oily skin, and this foundation was not made for my skin type, so it gets VERY greasy throughout the day, but I'm not a fan of drying products. It is easy to touch up with a mattifying powder and the product is very long wearing.\r\n\r\nNow the reason why I LOVE this foundation: it makes my pitted box-car acne scarring look not so bad! If you have any texture, this product will 1000% improve the appearance while still looking natural. It covers up red acne scarring perfectly as well! If they could release a slightly less greasy version of this it would be perfect", "I wanted to love this foundation, because the color match was AMAZING! I had never found a foundation that matched so perfectly with my skin color. \r\n\r\nI had purchased it after trying it at Sephora. After using for two weeks I had to return it. I have oily skin, with dry areas around my nose. I also have large pores on my cheeks near my nose. Though the initial application of this product was flawless, my skin was so slick within an hour. This is after using a matte primer, and setting powder and spray. I had to keep reapplying setting powder every hour because I was so oily. I was actually oilier than I usually am without makeup, or with using other foundations. What a disappointment, because I loved everything else about this foundation. \r\n\r\nIt literally went on so smooth, and the coverage was buildable. Great coverage for any dark spots, and large pores. Just not so great with my oily skin :-(.\r\n\r\nIf anyone with oily skin has found a way to use this without the increased oil production, please let me know, because I would love to try it out again, that's how much I loved its wear!", "The best foundation ever! I’m currently trying about 7 different foundations and this is by far my favorite."], "date": ["16 Aug 2016", "26 Nov 2015", "27 Apr 2017", "4 Feb 2017", "23 Apr 2017", "17 Jul 2018"], "score": [5, 5, 2, 4, 2, 5], "title": ["awesome foundation", "does not sick my face dry!!!!:)", "OVER-HYPED", "Very Natural", "Not for oily skin", "Best foundation ever!"]}, "figure_URL": ["https://www.sephora.com/productimages/sku/s2084648-main-grid.jpg"], "id": 4, "mini_figure_URL": ["https://www.sephora.com/productimages/sku/s2084648-main-grid.jpg"], "name": "Born This Way Foundation", "price": 39.0, "review_score": 3, "source": {"original_price": [39.0], "product_URL": ["https://www.sephora.com/product/born-this-way-P397517?icid2=products grid:p397517:product"], "source": ["Sephora"]}}