{"brand": "Hourglass", "comment": {"content": ["I was very hesitant on purchasing this foundation but I'm really glad I bit the bullet and tried it. I have abnormally oily skin but the foundation really helps keep the oiliness at bay. I still have to blot but not as much as I normally would. I top off the foundation with Makeup Forever's powder foundation for a little extra coverage. I love this combo. Its pricey but I'm loving it.", "This foundation was perfect for me, but unless you have VERY oily skin, it likely will not work for you. Also, even if you DO have oily skin, you have to make sure you've exfoliated; the first day I tried it, the makeup ended up looking caked on my cheeks. After stepping up my exfoliating routine, it perfects the appearance of my skin in an extremely natural way. It looks like I'm wearing no makeup at all!", "Okay, i'll start this off by saying I have SUPER oily skin for some reason. I'm talkin' 30 minutes after application, i could use a whole blotting paper. So any liquid foundation just slicks right off my face or doesn't last very long at all. Somehow I stumbled upon this foundation one day, read a few reviews, but I put it on the back burner thinking it would be just like every other foundation I've tried. It's a little pricey, too. A few weeks ago I decided to finally add it to my cart. (In \"Shell\" btw - I have light olive toned skin - NW20-25 ish) Its AMAZING! It comes out liquid, but as you spread it on your skin it turns to powder! It lasts about 6-8 hours depending on what I'm doing. I only powder (with my Tarte smooth operator powder) once mid-day. This is reallllly saying something for me. I'm SUPER happy and I love the finish it gives my skin! If you have on the fence, BUY IT!!!!!", "I am so in love with this stuff!  I need a full coverage foundation that doesn't upset my oily, sensitive skin.  This stuff is a MIRACLE.  I had been using UD all nighter, but it felt very heavy on my face.  With Hourglass, it doesn't even feel like I'm wearing makeup!  I'm a convert for life!", "Being an hourglass addict, I thought I'd try out their foundation. Just little fact about me; I have mainly oily skin, I am an esthetician who knows my specific/right skin care routine, and I am on retin-a micro.\nTo those on retin-a, it is imperative to make sure you lightly exfoliate and use a water based moisturizer before you use this foundation. If you don't, the flakes with be very exaggerated.\nAnyway...this is a very beautiful foundation. I have been a lancome teint idole ultra 24hr convert for 2 years, but have found that my oil slick is still a problem. My shade in lancome is 160 ivorie w and in this it's shell. It isn't as full coverage as I'd like, but that nothing a good concealer can't cover.\nHope this review has helped.", "I got this in nude as a sample and loved it, so I bought the full size in nude. It definitely kept me matte all day. I have a very oily face, but I'm also 54 and have a lot of peach fuzz, and I live in hot, humid Florida. The nude color turned orange on me after an hour. I tried the shell color. It was a bit pale, but better. My problem is, this foundation clumps in the creases and around my hair follicles (hairline, eyebrows, and peach fuzz), which isn't pretty. It also clumped around any skin imperfection. It made my wrinkles look worse. Plus, I could never quite find the right color. If I mixed the nude and the shell it was better, but I don't want to buy two of these again. I guess I may use it up just on my T zone, or throw it out."], "date": ["24 Apr 2015", "22 Aug 2016", "28 Jul 2012", "24 Jul 2017", "5 May 2013", "8 Jul 2013"], "score": [4, 5, 5, 4, 5, 1], "title": ["Hourglass Foundation", "Exactly what I wanted, but I'm not everybody.", "SO happy!", "GREAT for oily skin!", "Beautiful if you know how", "Second review"]}, "figure_URL": ["https://www.sephora.com/productimages/sku/s1944446-main-grid.jpg"], "id": 42, "mini_figure_URL": ["https://www.sephora.com/productimages/sku/s1944446-main-grid.jpg"], "name": "Immaculate Liquid Powder Foundation Mattifying Oil Free", "price": 56.0, "review_score": 3, "source": {"original_price": [56.0], "product_URL": ["https://www.sephora.com/product/immaculate-liquid-powder-foundation-mattifying-oil-free-P301802?icid2=products grid:p301802:product"], "source": ["Sephora"]}}