{"brand": "Yves Saint Laurent", "comment": {"content": ["Finally! A highlight cream that looks natural, yet noticeable on paler skin. It blended beautifully with my bb cream, foundation, concealer and powder. Love it and highly recommend it.", "I loved the demo videos of the touche eclat pens, swatched the lightest one and it was a good 4-5 shades darker than my skin. what the hey.\n\nI went in store at Sephora, was shown this option by an employee, and was blown away. It goes on white as liquid paper but quickly blends out to a beautiful glow. this acts as a highlighter for me in the usual spots, but I also use it as a base under my under eye concealer - it's absolutely stunning and undetectable, and I use far less concealer while maintaining a natural texture on my skin. It works well under or over other makeup products and it doesn't emphasize texture, clump, or breakup on my skin over the day. I wear it sparingly in certain spots because it can be too much due to the high pigment. it gives a natural glowing finish.\n\nI will say I struggle with getting the product to distribute consistently from the pen, but I think that will improve with use since the product is kind of suctioned in the tube. \n\nI usually wear the second shade of foundation in a large foundation range, for perspective of my skin color - nearly the lightest in 40 option. if you have oily skin this might not work for you because it could break apart. my skin is normal, but just something to consider.", "This is such a great product! It can be used over OR under makeup - I prefer it over which tends to dirty the brush a little but the finish is so natural and perfect for subtly highlighting the face. It gives such a perfect healthy glow for everyday. I put it under my eyes as well as along my cheekbones, down my nose, on my chin and on my forehead and it makes me looks so awake and put together!\r\nThe formula is quite quick-drying. I would not recommend using a beauty blender, rather a brush. The lasting power is great and I've used both concealer under and over this and it sits really perfectly as well.  I can't really say if it works well with the highlighting concealer though. I definitely recommend this product!", "Great for a little boost on my mode natural days. Doesn't mix well with a few of my foundations just looks Cakey but I still love it!", "I have a pretty pale skin tone but still wanted to get in on that bright undereye look before it takes its last breath and dies a dated death. I've tried various concealers, including a stark white one from another brand that just blended away to absolutely nothing. I had the same expectation for this, especially since the consistency for Touche Eclat is fairly thin. But I'm happy to say I was proven wrong! This ACTUALLY brightens/whitens up the areas I apply it. It blends out without disappearing easily with both a brush and my finger (I don't blend it with the application brush wand thing - I don't think that's super effective). \n\nI hope this isn't limited edition. While I can't speak for all skin tones, I can say that for pale skin this is kind of a dream come true if you're looking for that bright beaming effect."], "date": ["1 May 2017", "1 Jul 2018", "26 Apr 2017", "5 Sep 2017", "22 Jun 2017"], "score": [5, 5, 5, 4, 4], "title": ["Fantastic!!", "a must buy for lovers of a natural glow", "Perfect for adding light and dimension!", "No make up make up boost!", "Finally found a bright white that works"]}, "figure_URL": ["https://www.sephora.com/productimages/sku/s1919810-main-grid.jpg"], "id": 482, "mini_figure_URL": ["https://www.sephora.com/productimages/sku/s1919810-main-grid.jpg"], "name": "TOUCHE ECLAT WHITE Ultra Brightening Pen", "price": 38.0, "review_score": 3, "source": {"original_price": [38.0], "product_URL": ["https://www.sephora.com/product/touche-eclat-white-ultra-brightening-pen-P418834?icid2=products grid:p418834:product"], "source": ["Sephora"]}}