{"brand": "Sephora Favorites", "comment": {"content": ["I went back and forth on getting this set after the price was dropped. I ended up going for it because I REALLY wanted the Charlotte Tilbury lipstick and figured the rest was pretty much bonus even if I didn’t love one or two. \nWhen I got it home and started testing them I kept thinking, “It’s okay, I’ll just give that one to my sisters... and that one... and that one...” it just kept going downhill and I just don’t think this set is my cup of tea and I might return the whole thing.\nI have a light and fairly neutral complexion and these mostly don’t suit me or are too bold for me to feel comfortable in. Don’t trust the swatch pictures on the box - they are way off. I would recommend this IF you have a darker complexion or regularly go for bold lips then I think you could get more use out of this and it might be worth it for you. \nSome specific thoughts: \nThe Sephora lip stain and the Too Faced melted matte were both quite grey and made me look dead. The YSL is VERY watery - beautiful, but so so watery. The Bite is really goopy and patchy - hated this formula! The ABH looked like it wasn’t actually filled all the way (I’ll include a picture of right after I took the wand out for the first time). And the Huda was different than their regular lipgloss in the same Snobby shade (much pinker - I’ll include a picture of them swatched next to each other since that was one I already owned). Love the KVD, Smashbox and Marc Jacobs formulas but the colors are too bold for me. The Nars, Urban Decay and BareMinerals were okay colors and formulas but just nothing special. I like the Tarte gloss color and formula - wish that one had been full size and I might go buy that separately. The huda is great formula and color - different from the regular line in color but still great. And the Charlotte Tilbury is PERFECT. It’s the only reason I’m hesitant to return this set... but this lipstick alone is less than the set and I don’t think I’d really miss anything else sadly.", "Im so glad I purchased this! I admit, I was a bit hesitant to buy at first. In the past, most of the shades in the sephora lip boxes arent suitable for my complexion, but not this time! Almost every shade in the box, is beautiful on me! Thank you Sephora! Not sure if or when I'll find such a great deal on shades that look good in me, soooooo I will be purchasing another box this week!\nThanks again Sephora! Let's keep this product inclusiveness traingoing okkkkay!", "Have you ever gone on a date with someone who is great on paper but just not your cup of tea? This is a beautiful kit filled with high-quality products that I could never pull off, but that someone else will fall in love with. To be fair, I am ghostly pale but most of these shades are way too dark, brown or grey to be wearable. I'm also not a huge gloss girl, so the more neutral shades wouldn't get much wear from me either. However, the formulas are great and the value is wonderful if these are shades that work for you - ladies with a darker complexion or a braver mindset than me, this is a fantastic deal. I've included a swatch photo in alphabetical order (Anastasia to YSL) and I wear 115 Ivory in Maybelline Fit Me for reference.\n\nI, like a lot of you, had a hard time keeping this out of my basket because of the siren call of the Charlotte Tilbury lipstick. On swatching, it's worth noting that it's actually pretty close the Bite \"Chai\" lipstick that was part of the birthday kit this year and I've included swatches of them side by side (CT on left and Bite on right). The formula for Chai is not as matte and slightly darker/cooler but might be kinder to your wallet if that's your main interest in this kit.\n\nFor me, I'm probably going to have to return this one because I can't justify almost $100 CAD with tax for a few lovely shades.", "pretty decent mix of bolds and nudes, but whether or not you like this depends on what you're looking for. I love a bold lip, so the stand outs for me were the Marc Jacobs, Smashbox, ABH, and Bite. The Huda, Sephora Collection, and Too Faced were repeats for me, which was disappointing. This is a continuing criticism of these Sephora Favorites sets and I wish Sephora would listen. Another criticism is that the shades in person are much different from how they've been photographed. I almost didn't buy for that reason and only decided to take the plunge because I always buy the big Sephora Favorites lip set. I'm glad I did."], "date": ["7 d ago", "5 Nov 2018", "26 Sep 2018", "29 d ago"], "score": [3, 5, 4, 4], "title": ["The value is there but I don’t like the colors", "Amazing Value and Flattering on Black/Brown Skin!!", "Someone else's HG Lip Kit", "great selection of full-size products"]}, "figure_URL": ["https://www.sephora.com/productimages/sku/s2131316-main-grid.jpg"], "id": 488, "mini_figure_URL": ["https://www.sephora.com/productimages/sku/s2131316-main-grid.jpg"], "name": "Give Me More Lip", "price": 47.0, "review_score": 4, "source": {"original_price": [47.0], "product_URL": ["https://www.sephora.com/product/give-me-more-lip-P436327?icid2=products grid:p436327:product"], "source": ["Sephora"]}}