{"brand": "Benefit Cosmetics", "comment": {"content": ["I've used Benefit Rollerlash for a couple years -- and really, it's always my go-to. I try other mascaras that claim longer, lusher, etc lashes, but none truly compare to rollerlash. It really does enhance each individual lash, and it gives a little curl to them, so if you're rushing, and want to skip using your eyelash curler, it's okay -- they'll already be curled! Love it!", "Benefit Roller Lash Mascara is the best Mascara on the market. It really does everything it claims it do!! It separates your lashes, lengths, adds volume and curls each lash. Then on top of all of that, this Mascara stays put until you take it off. It never flakes on your face. I love this mascara. I never wear any other mascara. I only wear Benefit Roller Lash Mascara, because it's the Best!! I know I pay a little more for it, but it's worth every penny... It's just like my mother always told me, for quality products, I may have to pay a little more, but I would get my money's worth!! I believe with Benefit Roller Lash Mascara, I definitely got my money's worth, plus more. Your lashes will make your eyes look Beautiful!! If you try this mascara, you will love it. If for some reason you don't like it, simply return it with your receipt and get your money back or another mascara. But trust me, you won't do that. You will return to the store, to buy more Benefit Mascara. :)", "I was hoping this mascara will be my savior for my short, super straight, downward lashes, but it didnt. This mascara did not work for me at all. I even curled my lashes before application, it still did not work. It clumps, flakes, and smudges.", "This small little brush works wonders! Not only does it make your lashes look extremely long, it also seems to separate them so they don't clump together! My new favorite!", "I love this mascara and never leave myself empty handed without it!! I've tried numerous curling mascara like Mac and Dior and none of them ever compare to Benefits Roller lash, I always go back to Benefit and always highly recommend this to my family and friends. I find Roller lash to be very Bold and makes my lashes triple in length making my eyes look so awake, and the curling effects make my lashes look like I've spent a lot of time using A lash curler.. Which is just one more tool and time I can eliminate from my morning routine! I highly recommend this mascara to anyone looking for the perfect mascara that provides all the benefits rolled into one little cute black and pink tube that makes your lashes and eyes look like a million dollars!!", "I love this mascara in brown. Gives just the right amount of color. I wanted to have a more natural look (I am getting older!), and this one is great. Please don't stop making the brown.", "Great mascara, I love it for every day. Does not flake or clump. Leaves my lashes looking long, dark & defined.", "I used this mascara since it first came out but took a break to see if drugstore brand mascara was just as good, and better for my bank account. After a month of hating what I was using I came back to the Roller Lash Super Curling & Lifting Mascara. It does such a nice job separating each lash and making them long and beautiful. It's also doesn't dry out your lashes or make them feel stiff and chemical-y. My lashes are always very soft and the mascara comes off easy at the end of the day. The only downside is that the mascara takes a few minutes to fully dry, so be careful when applying. Likely you will have to take a Q-tip to wipe off extra goo that occurs when you blink or sneeze. No big deal, just be aware. Likewise, this mascara is not water-proof."], "date": ["11/23/18", "11/06/15", "10/29/18", "10/29/18", "04/21/18", "07/26/18", "07/25/18", "04/26/17"], "score": [5, 5, 2, 5, 5, 5, 5, 5], "title": ["Love this mascara!", "Benefit Roller Lash Mascara is the Bomb....", "Did not work on me", "AMAZING AMAZING AMAZING.", "Best curling mascara EVER!!!", "Best Mascara Ever", "Love it", "Great Mascara"]}, "figure_URL": ["https://images.bloomingdalesassets.com/is/image/BLM/products/3/optimized/10123223_fpx.tif?$2014_BROWSE_FASHION$&hei=350&wid=280"], "id": 500, "mini_figure_URL": ["https://images.bloomingdalesassets.com/is/image/BLM/products/3/optimized/10123223_fpx.tif?$2014_BROWSE_FASHION$&hei=350&wid=280"], "name": "Roller Lash Curling & Lifting Mascara", "price": 25.0, "review_score": 4, "source": {"original_price": [25.0], "product_URL": ["https://www.bloomingdales.com/shop/product/benefit-cosmetics-roller-lash-curling-lifting-mascara?ID=3190900&CategoryID=2921"], "source": ["Bloomindale"]}}