{"brand": "Benefit Cosmetics", "comment": {"content": ["I love this stuff! I've tried pencils and powders and clear gel and nothing compares to my Gimme Brow! It's so easy to use for someone like me who loves my makeup...but doesn't have an hour to look selfie perfect each day...its swipe and go.", "I'm an over-plucker of my eyebrows and this stuff is great. Easy to use and looks fabulous. Will buy again.", "Good coverage, color for gray & thinning eyebrows. Keeps brows in place.", "I had 2 issues with this product. The shade range is what makes this product a main no-go for me. First, there are only 3 shades. 2 out of the three are COOL toned. The lightest and the darkest. I purchased the darkest, 05 thinking it would be similar in shade to their 05 (warm) in their Benefit Goof Proof Brow Pencil. It is not. I have a warm undertone and just find the warm toned brow colors look best against my skintone and less harsh. In my opinion they should have just renamed them to avoid any confusion. 05 in this cool tone shade is not a one-size fits all for dark brow hairs. My other issue, is that it was too messy. I have patchy brows and I found the formula, came out too thick and clumpy and stuck to any exposed skin and made it difficult to fill in. I used it as directed, tried brushing it back, ultimately I think the color was just too cool and it didn't blend well. I do like the tip for filling in sparseness at the front of my brows. I think the formula could be improved and the shades extended to include more warm tones, especially for the dark brown shade. For now I will stick with their pencil.", "I think I've tried just about every option and brand out there to fill and darken my brows. This is by far my favorite. I think I'm finished exploring other options!", "Makes almost no difference! Not worth the price at all...", "I love this product. So much better & easier to use than pencils. Looks far more natural. Great for people like me who have sparse, blond eyebrows. I highly recommend! I chose color #3.", "love this product...my brows are thinning...this adds nicely ....makes my brows pop....have bought it several times....easy to use...."], "date": ["11/30/18", "08/10/18", "08/03/18", "12/16/16", "07/21/18", "07/20/18", "06/22/18", "06/09/18"], "score": [5, 5, 5, 2, 5, 1, 5, 5], "title": ["My go-to for my brows!", "This stuff is great!", "Love this", "Needs a Dark brown Warm Shade", "My favorite!", "Not worth it", "Best stuff ever!", "love this product"]}, "figure_URL": ["https://images.bloomingdalesassets.com/is/image/BLM/products/1/optimized/10123221_fpx.tif?$2014_BROWSE_FASHION$&hei=350&wid=280"], "id": 503, "mini_figure_URL": ["https://images.bloomingdalesassets.com/is/image/BLM/products/1/optimized/10123221_fpx.tif?$2014_BROWSE_FASHION$&hei=350&wid=280"], "name": "Gimme Brow+ Volumizing Tinted Eyebrow Gel", "price": 24.0, "review_score": 4, "source": {"original_price": [24.0], "product_URL": ["https://www.bloomingdales.com/shop/product/benefit-cosmetics-gimme-brow-volumizing-tinted-eyebrow-gel?ID=3190892&CategoryID=2921"], "source": ["Bloomindale"]}}