{"brand": "Dr. Dennis Gross Skincare", "comment": {"content": ["I've been a big fan of this company's products and was especially excited to try this product. Being a busy on the go mom means I really don't have much time for more than 5 minutes treatments. hence I rely on sleep masks, night time treatments etc. this takes 2 minutes that's it and the results are incredible. I use it 2x a week after my shower at night and before I use any face products. In the morning my face is glowing and much smoother!", "I love these for travel since they're so convenient. They do tingle but they don't irritate my skin, and they leave my face soft and glowy and ready to absorb a good moisturizer.", "I love these pads! I decided to purchase these because of the great reviews. I regularly use a lactic acid and a salicylic acid, so I didn't have much faith that these pads would make a difference, particularly with the large pores on my nose and cheeks. I can't tell you how many products I have used that claim to minimize the appearance of pores with minimal results at best. I have only used these for 3 days now (cut in half to economize) and the results have been amazing. I am thrilled with the results. The only con is the price, but when I find a product that works in ways other products do not - a TRUE Holy Grail - then I will find a way to afford them. You need to try these!!", "Slightly dry skin, with cystic acne once a month - yay womanhood! \n\nI'm actually surprised by how well this works. The pores around my nose are large and always congested looking. Microdermabrasion was the only treatment that worked. I gave this a try one evening, didn't look too closely before going to bed, but when I woke up my skin had the same bright, non-congested look Mirco treatments gave me. Three days later my skin still looks great. This is a holy-grail product if you're looking for a quick at-home fix to tighten pores and reduce congestion. Worth the money. My mind is blown, I've never had an at-home treatment work so well!", "My skin is used to acids, so this didn’t do anything, but these would be a good gift idea or for traveling."], "date": ["4 May 2018", "2 Jun 2018", "9 Apr 2018", "13 Jul 2018", "29 d ago"], "score": [5, 5, 5, 5, 2], "title": ["Dr. Dennis does it again!", "Effective and easy", "True Holy Grail", "Like Microdermabrasion - but at home with wine", "if you have pcos this will change your world."]}, "figure_URL": ["https://www.sephora.com/productimages/sku/s1352194-main-grid.jpg"], "id": 594, "mini_figure_URL": ["https://www.sephora.com/productimages/sku/s1352194-main-grid.jpg"], "name": "Alpha Beta Extra Strength Daily Peel Mini", "price": 17.0, "review_score": 4, "source": {"original_price": [17.0], "product_URL": ["https://www.sephora.com/product/alpha-beta-r-peel-extra-strength-daily-peel-mini-P425868?icid2=products grid:p425868:product"], "source": ["Sephora"]}}