{"brand": "Lab Series For Men", "comment": {"content": ["My husband loves this lotion and uses it everyday. I also use it in the morning to reduce fine lines and puffiness. The product is lightweight and soothing. It's very different from women's eye cream since it isn't at all moisturizing and creamy.", "All brand seems to mark up the price for eye treatment very high. I tried it and love it. I don't care if it's made for men. I find the texture is just right / light !!! Finally, my eyes got rescue!!", "I have tried many anti-aging eye cremes for MEN particularly. This one is by far the best eye cream for correcting first signs of aging and prevention down the road. After only a week my eye area was brightened, smoother, my small fine lines were less noticeable, and it is very refreshing. I use this morning and night. After almost one year of use, and the results I have personally seen, I will continue to invest in this anti aging eye cream. I am 30 years old by the way so I am glad I found this sooner rather then later.", "I got this for my fiance after he complained about his dark circles and appearance of fine lines and within a week we both noticed a visible improvement. He also likes how it absorbes quickly and doesn't have any residue. After he ran out, I picked up a different brand for him at the same price just to try and he hated it! We went back to this one and he's been a happy camper ever since!"], "date": ["2 Feb 2011", "3 Mar 2011", "28 Dec 2012", "10 Aug 2009"], "score": [4, 4, 5, 5], "title": ["Soothing, diminishes fine lines, puffiness", "wonderful product", "best anti-aging eye creme", "Boy gives it the thumbs up"]}, "figure_URL": ["https://www.sephora.com/productimages/sku/s912584-main-grid.jpg"], "id": 5476, "mini_figure_URL": ["https://www.sephora.com/productimages/sku/s912584-main-grid.jpg"], "name": "Age Rescue Eye Therapy", "price": 43.0, "review_score": 4, "source": {"original_price": [43.0], "product_URL": ["https://www.sephora.com/product/age-rescue-eye-therapy-P124925?icid2=products grid:p124925:product"], "source": ["Sephora"]}}