{"brand": "Dr. Dennis Gross Skincare", "comment": {"content": ["Keeps my skin clear and bright. I have sensitive skin, so use about once a week in rotation with the retinol and ferulic acid peel.", "I have very sensitive skin and this product works great! I use it twice a week and gives me a fresh healthy glow without irritation", "I made an account just to review this product because it’s so fantastic. I received this as a birthday gift from Sephora and I wasn’t sure about using it at first. Few days later I realized that this would be a better way of washing my face while on vacation in Jamaica seeing as I wasn’t going to check any of my bags. The first day I was a bit skeptical but after the 3rd day of my vacation and using the second application I saw an extreme difference in the softness of my face and the glow. My whole family asked what was going on with my face and complimenting how clear it was. EXTREMELY happy to see that it’s reasonably priced. Will definitely be buying for special occasions as in vacations and weekends away at the bf’s.", "This really helped to dull the scars left from my hormonal acne. I started using it every other night with my first 5 treatments and then changed to every night with my next 5 treatments.  Give it a try!", "WOW! Completely BLOWN AWAY by these little miracle pads!!! My skin has NEVER looked & felt more amazing!!! Bright, even, smooth, soft, glowing. My husband doesn’t even notice or realize when I get Botox, but he has commented, more than once, how great my skin looks...which is, of course, the true testament (not really, lol). I was slightly worried about my skin becoming more dry from these, but the results have been the complete opposite. I’ve already purchased the one month supply!"], "date": ["22 Feb 2018", "10 Mar 2018", "8 Jan 2018", "11 Jan 2018", "21 Apr 2018"], "score": [5, 5, 5, 5, 5], "title": ["Great product", "Must buy!", "Helped with scaring", "GAME CHANGER", "AMAZING!"]}, "figure_URL": ["https://www.sephora.com/productimages/sku/s1450964-main-grid.jpg"], "id": 595, "mini_figure_URL": ["https://www.sephora.com/productimages/sku/s1450964-main-grid.jpg"], "name": "Alpha Beta Universal Daily Peel Mini", "price": 17.0, "review_score": 4, "source": {"original_price": [17.0], "product_URL": ["https://www.sephora.com/product/alpha-beta-r-universal-daily-peel-mini-P425869?icid2=products grid:p425869:product"], "source": ["Sephora"]}}