{"brand": "Benefit Cosmetics", "comment": {"content": ["My teenage daughter loves the Hoola Matte Bronzer. On most days that is all she wears and her skin looks even more beautiful but still natural. She is fair skin but can wear this without looking dark or orange. She got me buying it for myself now. Macy's has sale on these throughout different times of the year and at the best price. I love the free shipping, too.", "This is my go to bronzer. Its very pigmented, but blends easily for a flawless finish.", "I usually hate the applicators that beauty products come with, but this Hoola brush helps evenly blend out any mistakes I make while applying the bronzer! It is the best shade ever, and I cannot get enough of it!", "There's a reason why everyone buys it. It's great! Blends smoothly. Gives me a natural finish when I want and is buildable when I want something more pronounced.", "Have been using this for years, great color! Can build to darken or use for a hint of color", "the reason I gave 4 stars is because the package is very cute , however not practical at all. Very awkward. the product itself is amazing. I would recommend it.", "I love this bronzer. A little goes a long way. I would definitely recommend it to everyone.", "Love the range of bronzers available and this one is perfect for my skin tone. Have been wanting to purchase and when I saw the incredible price at Macy's at 50% off, couldn't pass the offer. Very happy with purchase and bronzer."], "date": ["11/17/18", "11/14/18", "10/29/18", "09/16/18", "07/08/18", "07/03/18", "06/29/18", "06/18/18"], "score": [5, 5, 5, 5, 4, 4, 5, 5], "title": ["Hoola Matte Bronzer", "Best Bronzer", "My favorite holy grail for bronzer!", "Cult Classic", "My favorite", "Great product and color", "Love love love", "Perfect Bronzer"]}, "figure_URL": ["https://images.bloomingdalesassets.com/is/image/BLM/products/4/optimized/10123904_fpx.tif?$2014_BROWSE_FASHION$&hei=350&wid=280"], "id": 504, "mini_figure_URL": ["https://images.bloomingdalesassets.com/is/image/BLM/products/4/optimized/10123904_fpx.tif?$2014_BROWSE_FASHION$&hei=350&wid=280"], "name": "Hoola Matte Bronzing Powder", "price": 30.0, "review_score": 4, "source": {"original_price": [30.0], "product_URL": ["https://www.bloomingdales.com/shop/product/benefit-cosmetics-hoola-matte-bronzing-powder?ID=3190972&CategoryID=2921"], "source": ["Bloomindale"]}}