{"brand": "Laura Mercier", "comment": {"content": ["I have been using Laura Mercier Translucent Loose Setting Powder Glow the past couple of weeks and I love it. So this is exactly what the package says. It is a yellow undertone powder (which is perfect since it won't give you flashback at pictures because it doesn't have the whitecast). It is very glowy so I won't recommend it for everyday use and rather use it for a night out. Since is very glowy and sparkly I use it for strobing or lighting up my face. I love to mix it up with Mac strobing cream and then seal my makeup with this setting powder. The texture of the powder is very lightweight and the formula give you a silky like result. Sometimes I use this powder as everyday highlighter/shadow so I get this fresh and glowing result (mixed with Mac fix plus or tapping a Nivea cream to make the skin look more hydrated). I love Laura mercier and this time the brush which is silk on the face and this glowing powder are so cool that I have been obsessed about it. [This review was collected as part of a promotion.]", "I was super excited when I discovered I would be receiving this product complimentary for testing purposes through Influenster. I've heard nothing but rave reviews for Laura Mercier's original setting powder from beauty gurus on a YouTube and Instagram who describe it as a holy grail item. Perhaps my expectations were unrealistically high as a result, but I was really underwhelmed by this product. It did the job (setting my makeup and leaving my skin with a glowing finish), but I found that I needed to use a light hand applying it, or it caked and cracked (particularly in areas with fine lines), and I didn't love that sparkes in the product created the shine. That being said, when applied lightly, I found it set my makeup nicely for long lasting wear and felt lightweight. It was just a bit finickey to apply. I think if you want to spend a bunch of money on a bougie product, this works fine, but there are better and more cost effective options out there. [This review was collected as part of a promotion.]", "I received this powder a few days ago from influenster complementary and I'm in love !!! This powder is so beautiful on the skin , I use this product in combination with the original Laura Mercier powder and I cannot get enough! So after I apply my foundation and concealer I love to set my under eyes with the original powder just because I feel like this powder is for a all over glow and to set the face instead of the under eyes ! Then I take the glow powder brush and dip into the powder and set my entire face sweeping the glow powder on the high points of my cheeks ! It's super subtle & yet stunning , it doesn't have huge chunks of glitter it's very smooth and finely milled with a sheen that catches the light when ever you move your face a certain way !! The shade range I feel like is reasonable knowing they have the regular translucent & the translucent medium deep all skin tones should be able to use this powder but yes I recommend this powder for a all over glow not so much for under baking under the eyes ! [This review was collected as part of a promotion.]", "I LOVE this product! I currently own/use shade translucent and it's a shame they only have two shades out. They seem to be pretty versatile and look good in almost all skin tones, but I'd love to see different nuances and undertones added to the glow collection. First time I used the product I made the mistake of trying to bake with it, and ended up looking like a disco ball. After that, i only apply a small amount to the elevated areas of my face and always tap away the excess product. The result is a GORGEOUS even glow that looks a lot more natural than my usual highlighter. If I want a more dramatic glow, I'll apply my usual highlighter on top of it. I got many compliments on the look, saying that my skin looks dewy. I had a great experience with the product and would recommend it to you as well! Have fun glowing! DISCLAIMER: I received the product complimentary for review purposes through Influenster! [This review was collected as part of a promotion.]", "For starters, THANK YOU INFLUENSTER for sending me this. I'm so in love with the texture of this powder, the glow it gives, and the way it wears throughout the day. To see how the powder would fair throughout the day, I didn't set my face with setting spray. I wore my makeup in 85°F heat (on and off) for 10 hours and it not only stayed in place, but also continued to keep me oil free and radiant. I felt incredible about how my complexion looked using this powder. I used it on all the high points of my face as you would highlighter, under my eyes a bit, and also a small amount on my jaw under my contour. Even though the powder has VERY fine flecks of glitter in it, I found that it didn't look chunky or unnatural at all. I got so many compliments on how radiant and glowy I looked. I would absolutely recommend this to those who love a healthy, radiant looking glow to their skin. The fine glitter and glow of the powder could potentially accentuate texture or pores on the skin, however, the powder is VERY smooth and really makes the skin look airbrushed and soft. [This review was collected as part of a promotion.]", "I was so happy to receive the Laura Mercier box! I received the original translucent powder, the translucent glow powder and the oddly-shaped brush to go with the glow powder. I am reviewing the glow powder, which I must say...is WAY glowier than I anticipated. I thought it was going to be a setting powder with a *tiny* bit of glow or sheen, but I have to admit this is almost a very modest highlighter. If you don't like to GLOW super brightly, but do enjoy a light amount of reflection and health to the face, this powder is pretty. I couldn't use it on my entire face, cuz that would look a bit strange. But over the cheeks and cheekbone area, looks really pretty. The translucent glow powder has a yellowish gold tint to it, very reminiscent of the MAC gold strobe cream. It might not look super flattering on extremely fair individuals, but I think it's pretty on my light skin tone. It would probably look best on medium skin tones though. I'll likely end up the whole thing! Although I'm not certain I'll repurchase. Also, the brush is very odd lol. I'd much rather use a normal powder brush. [This review was collected as part of a promotion.]", "Alright so first let me begin by saying this is my first Laura Mercier product I've ever tried and the second setting powder I've used. I'm deff a fan of setting sprays over setting powder because I don't like powders in general. I was sent this complimentary of Influenster to try out and write a honest opinion. In all honesty I didn't love it but I didn't hate it. Here's my explanation: It did what it was supposed too, set my make up and give a \"glow\" effect. However, this \"glow\" was just gold sparkles which I was not a fan of. It looked like my eyeshadow had a lot of fall out which is never a good look. I feel like it looked like I used a light coat of gold powder highlight all over my face. Maybe for some that would look nice but not on me because powder looks heavy. Keep in mind, I'm not a powder girl because I hate how it wears on me. I'm also not a glitter girl, when I do highlighter I do a liquid go look dewy. Overall- I think this is a good summer setting powders for those who like setting powders. For me though, I will try it out a few more times this summer and see if it can grow on me. [This review was collected as part of a promotion.]", "I enjoy this powder but not for reasons I had originally expected. This is not a powder you can necessarily bake with or set the whole face with, it is VERY shimmery, similar to a natural highlight. While I do like to use it along my cheekbones, under/over my bronzer and blush, I will probably not purchase this (I received this product as a free sample) just to the fact I have other products that I prefer, I have natural highlights and I have other setting powders that I prefer (I.e. the original Laura Mercier Translucent Loose Setting Powder, & the COVER FX Perfect Setting Powder). If you are looking for a simple glow setting powder I would highly recommend theHourglass Ambient Lighting Powder, they add glow but not shimmer like this one. However if you do like the all over highlight look (no judgement I used to be that person too) then this is just the powder for you. [This review was collected as part of a promotion.]"], "date": ["09/25/18", "09/20/18", "08/15/18", "09/23/18", "08/14/18", "08/15/18", "08/21/18", "08/18/18"], "score": [5, 3, 5, 5, 5, 4, 3, 3], "title": ["I have been using", "I was super excited", "I received this powder", "I LOVE this product!", "For starters, THANK YOU", "I was so happy", "Alright so first let", "I enjoy this powder"]}, "figure_URL": ["https://images.bloomingdalesassets.com/is/image/BLM/products/4/optimized/10083494_fpx.tif?$2014_BROWSE_FASHION$&hei=350&wid=280"], "id": 5287, "mini_figure_URL": ["https://images.bloomingdalesassets.com/is/image/BLM/products/4/optimized/10083494_fpx.tif?$2014_BROWSE_FASHION$&hei=350&wid=280"], "name": "Translucent Loose Setting Powder Glow", "price": 38.0, "review_score": 4, "source": {"original_price": [38.0], "product_URL": ["https://www.bloomingdales.com/shop/product/laura-mercier-translucent-loose-setting-powder-glow?ID=3118261&CategoryID=2921"], "source": ["Bloomindale"]}}