{"brand": "Dr. Dennis Gross Skincare", "comment": {"content": ["My first review ever on Sephora's site, but I can't not share fantastic feedback on this product - and Dr Dennis Gross's line.  I have freckles and sunspots from years of tanning and a routine of Brightening Solution   the Ferulic Acid   Retinol Overnight Serum has faded my 2 very evident sunspots and lightened my freckles.  I also do at-home glycolic peels on a monthly basis, but these 2 products changed my skin.  If you've given up on your sunspots - try this.  Amazing results and I've been using for almost a year with no new spots.  :-)", "It works - I have firmer, younger skin with reduced fine lines after using for 5-6 days. Does what it says it will do.", "I've used this nightly for about a month and noted the difference right away. My skin looked brighter, then the small acne bumps cleared and what breakouts I have are easily resolved.\nNo irritation like Retin A.\nOverall my skin feels plumper, more hydrated and smoothe.", "I research products before I purchase. I look for legitimate claims with ingredients that hold up to my scrutiny. I've tried many anti-aging products, this one works for me and my routine (don't ask). As a light-weight oil, a little goes a long way, it is readily absorbed on clean skin, and doesn't interact (glom-up) with other products I use. My skin has noticeably improved in clarity, radiance, while ironing out those fine wrinkles.", "This stuff is amazing. I have been using it in conjunction with the Alpha Beta Peel by Dr. Dennis Gross and my skin has never been better. I have struggled with acne, scarring and large pores for over 10 years until now. My skin tone is MUCH more even, my skin is firm and acne scarring has faded. Best of all, this even makes my skin feel amazing and soft. It is not harsh or drying at all. I couldn't be happier. THANK YOU DR! Plus, it's vegan! Worth every penny.", "I was looking for a good retinol serum for some time after doing research about how they benefit skin. I have fair, sensitive, dry skin with some blemish/acne issues around my chin. So, after all of my searching, I was suggested to try Dr. Gross Solution. So glad I did! It's lightweight, feels really good, and I love the way it has brightened my skin, giving it a beautiful glow. Best of all, though it is effective for pesky pimples and damaged skin, it's also gentle on my sensitive skin. Seriously, the only downside is the price, but if you look at it like an investment, you can't go wrong."], "date": ["29 Aug 2017", "23 Jan 2016", "28 Jan 2015", "30 Aug 2014", "8 Oct 2012", "28 Oct 2015"], "score": [5, 5, 5, 5, 5, 5], "title": ["Game changer for dark spots!", "Tighter firmer skin, reduced fine lines", "Clear & bright", "Excellent Investment. It works!", "A True Miracle!", "Apprehensive at first, but glad I purchased"]}, "figure_URL": ["https://www.sephora.com/productimages/sku/s1450881-main-grid.jpg"], "id": 603, "mini_figure_URL": ["https://www.sephora.com/productimages/sku/s1450881-main-grid.jpg"], "name": "Ferulic Acid + Retinol Brightening Solution", "price": 88.0, "review_score": 4, "source": {"original_price": [88.0], "product_URL": ["https://www.sephora.com/product/ferulic-acid-retinol-brightening-solution-P375269?icid2=products grid:p375269:product"], "source": ["Sephora"]}}