{"brand": "Dr. Dennis Gross Skincare", "comment": {"content": ["Loved this! I doubt I'd use it every day, once a week would probably suit me. I used this before a clarifying mask to try and clear up an ugly breakout - dry skin, acne, pimples, the works - and it was literally gone. In minutes. By the end of the day you couldn't tell anything had been wrong! This far exceeded my expectations for the product, so much so that I created an account just to review it.", "Awesome product. I have super sensitive skin and was worried about using any product like this.  After reading the reviews I decided to try.  I love it. Makes your skin so smooth and helps fade old acne scars.  My face is slightly red for 2 minutes after using, but that is it. I will definitely buy again.", "I didn't think this would get as much dead skin off as it does - after all, I use an exfoliating cleanser daily, but I tried this anyway. It is fantastic. It really makes a difference in my skin's radiance. The only caveat is for me at least, my skin really flaked after the first few uses (the whole point, but still), and so I would definitely recommended using this at night to begin with so you don't find your makeup flaking off the next day along with your skin.", "I had this lingering cystic pimple for MONTHS and this got rid of it in one use. My skin is so soft and clear I love it. It burns a little but I still really enjoy it."], "date": ["20 Dec 2015", "17 Oct 2016", "21 Aug 2016", "13 Jan 2017"], "score": [5, 5, 5, 5], "title": ["Spectacular", "So good", "New favorite", "Great for smoothing texture."]}, "figure_URL": ["https://www.sephora.com/productimages/sku/s1722487-main-grid.jpg"], "id": 611, "mini_figure_URL": ["https://www.sephora.com/productimages/sku/s1722487-main-grid.jpg"], "name": "Alpha Beta Ultra Gentle Daily Peel for Sensitive Skin", "price": 88.0, "review_score": 4, "source": {"original_price": [88.0], "product_URL": ["https://www.sephora.com/product/alpha-beta-ultra-gentle-daily-peel-sensitive-skin-P398761?icid2=products grid:p398761:product"], "source": ["Sephora"]}}