{"brand": "HUDA BEAUTY", "comment": {"content": ["I purchased two shades that I thought would match me because there aren’t any restocked in stores. So couldn’t shade match for starters. Custard did match really well, so I’ll give Huda that. But it didn’t look good on the skin. &  it did not wear well through out the day. Usually for me I know if I’ll love a foundation nearly as soon as I get it all over my face, and I wasn’t impressed. I had high expectations, and I was let down to be honest.  And it made me break out. At first I thought maybe it didn’t wear well or look well at first because I used a brush and not my holy grail beauty blender, wrong. Tried it again with the beauty blender, still didn’t look good. But the whole making me break out was enough for me to stop using it at the time. Before I returned it, I said I’d give it one more shot about a month later. Tried it again. Same disappointing results. Made me breakout again. (Why did I do my skin dirty like that?!) long story short: doesn’t apply well, doesn’t wear well, made me breakout, and returned both", "smells very good, however I had to return it because it was very cakey did not blend well ,and 2 hours later it looked horrible", "I am a full coverage foundation junkie, so anytime a new full coverage foundation comes out, I have to try it. All I can say about this foundation is that I LOVE IT! This foundation is very full coverage and blends very nicely. I always start with a cleansed and moisturized face, then I always use a primer before applying any foundation. This foundation should absolutely be used after the face is clean, moisturized and primed, because it is so full coverage and no one wants the dry cakey look that some full coverage foundations can cause. This product has a nice, fresh and pretty scent to it. The scent may be too strong for some or it may not be liked by everyone, however, I enjoy it! \n\nI spray tan so I was able to find about 3 different shades that matched my skin tone beautifully depending on how tan I am. This foundation is just amazing and it is my new holy grail foundation! I absolutely love the coverage and how easily it blends. This foundation also lasts a LONG time, which I really appreciate! I have tried it with and without setting spray, and it stays put for a long time either way! I also do not get any weird looking cakeyness, creasing or fading in random places with this product!\n\nSo, I really do recommend giving this foundation a try if you are looking for a very nice full coverage that lasts a long time and blends nicely!  It is $40, however, it contains a little bit more than 1 FL OZ --which is nice -- as most are usually 1 Fl OZ or less. I have also used it with several different types and brands of concealers and it works well with all of them, and it gives a flawless look even without concealer. I love how it plays nice with other products like concealers, contours, highlights and blushes! It doesnt give a muddy look when used under those products, which is very important to me!  it really is a great product! So give it a shot! I hope my review can at least help someone who is interested in trying it but hasn't pulled the trigger yet!", "This foundation has a LOT of mixed reviews, but for my oily/combination skin this is my new holy grail foundation! It’s the only one I’ve found that lasts an entire workday without turning into an oil slick and turning my forehead and nose into a mudslide. This foundation is extremely thick, so I highly recommend applying it with a damp sponge or beauty blender vs. a foundation brush. The coverage is so fantastic that I don’t need a concealer with it, and one pump is enough for my entire face. I do recommend using a good hydrating primer before application (I use Farsali Unicorn Essence and MAC prep and prime) followed by your favorite setting powder (I use Too Faced Born this Way)"], "date": ["21 May 2018", "4 Aug 2018", "28 Oct 2018", "6 Apr 2018"], "score": [1, 1, 5, 5], "title": ["MADE ME BREAKOUT", "Great Full Coverage Foundation!", "Holy Grail", "Hello beautiful looking skin!"]}, "figure_URL": ["https://www.sephora.com/productimages/sku/s2001774-main-grid.jpg"], "id": 6, "mini_figure_URL": ["https://www.sephora.com/productimages/sku/s2001774-main-grid.jpg"], "name": "#FauxFilter Foundation", "price": 40.0, "review_score": 3, "source": {"original_price": [40.0], "product_URL": ["https://www.sephora.com/product/fauxfilter-foundation-P424302?icid2=products grid:p424302:product"], "source": ["Sephora"]}}