{"brand": "bareMinerals", "comment": {"content": ["I can not say anything bad about this. I'm live it. Been using it for years.", "I use this mainly as a concealer for my acne scars and under eye circles with the small Full Coverage Brush. It works wonders! However, like all make-up, it will look make-upy if it is layered too much.", "bought this product recently for the new year in hopes of finally finding a make up that makes my skin look even and so far i LOVE it. however, it is not make your skin \"flawless\" if you have a pimple or something you still need to use a concealer. Overall though, it really is a great product. My skin looks even and glowing and I have gotten many compliments.", "I've come back to this after about 3 years of not using it because I was trying other foundations and what not... why did I ever stop using this!? Omg I love it! I'll admit that at first it looks just a bit powdery on my skin but once I'm done doing my hair and rest of make up it has meshed perfectly with my skin and it looks amazing! Make sure you're taking your time to blend blend blend!", "This stuff is wonderful and it changed my makeup routine. I used to have a little trouble with acne but now that I use this as my foundation, I've noticed a HUGE improvement. I love applying it, I love that it's good for my skin, and I love the coverage. Plus, the SPF is great.", "I have used this product for years and am very pleased with it.", "I have very sensitive skin and this is great", "I've been using this for the past 10 years. I try Other products and i always come back to my bareMinerals it's super versifale product from light coverage to full easily. It's great for concealing blemish just use a Concelear brush with a little foundations it's perfect!", "I use this everyday. This is my go-to that when I try other things, I come back to this. This provides good medium coverage, and I like that it isn't heavy or greasy. I have acne prone skin and I feel good that this make up doesn't make it worse.", "I've used bareminerals for over 20 years and I love it.", "It doesn't blend into skin look powdery sitting on top of nose mostly even with blending, other than that it's light weight and easy on my sensitive skin and covers w just a small amount", "I have used bare minerals for years. Best foundation I ever used couldn't stand the feel of wet foundation ever again 😃", "I use to really love wearing this as my only foundation, but now in my early 30s I just don't like the settling. Also, I don't know why but the colors I have always worn do not match my skin tone. I am very fair and even the lightest color appears orange.", "I use a Y6 morphe brush to buff onto my face. I've never tried the brush that is recommended for the product because I don't want to pay that much. The Y6 is like $8 at morphe and works well for me. I use bare minerals prime time primer first then put on concealer before the foundation. I've heard different recommendations with the product to put concealer before or after. I prefer before. \n*IMPORTANT* when running low you can open the bottom and get a few more uses. Use old tweezers to open it (if you use your ones you use regularly they will bend and get ruined) I've included a picture", "I have used this product for many years. The best one ever used."], "date": ["5 Sep 2014", "12 Aug 2011", "7 Jan 2011", "26 Apr 2017", "8 Nov 2008", "6 days ago", "6 days ago", "7 days ago", "8 days ago", "8 days ago", "8 days ago", "8 days ago", "9 days ago", "9 days ago", "13 days ago"], "score": [5, 5, 4, 5, 5, 5, 5, 5, 5, 5, 4, 5, 3, 5, 5], "title": ["can not live with out it", "great product", "Why did I stop using this!?", "Fantastic", "Harsh Weather Doesn't Win This Round!", "I would buy this product again", "Love", "Always faithful", "My go to", "Definitely would buy again!", "I'd appreciate more with a better foundation", "Love it!!!!", "I used to love it...", "This is my go to foundation!", "I've never used a better foundation"]}, "figure_URL": ["https://www.sephora.com/productimages/sku/s1922541-main-grid.jpg", "https://images.ulta.com/is/image/Ulta/5081179?$md$"], "id": 7, "mini_figure_URL": ["https://www.sephora.com/productimages/sku/s1922541-main-grid.jpg", "https://images.ulta.com/is/image/Ulta/5081179?$md$"], "name": "Original Foundation Broad Spectrum SPF 15", "price": 29.0, "review_score": 4, "source": {"original_price": [29.0, 29.0], "product_URL": ["https://www.sephora.com/product/bareminerals-original-foundation-broad-spectrum-spf-15-P61003?icid2=products grid:p61003:product", "https://www.ulta.com/original-foundation-broad-spectrum-spf-15?productId=VP11362"], "source": ["Sephora", "UTLA"]}}