{"brand": "Kat Von D", "comment": {"content": ["I absolutely love this foundation. I bought this in 52 and later purchased a 54 because I was a little tan. This foundation gives such a flawless finish, I used my sephora brush 61 and then used my beauty blender and your done. It's a build able foundation you just need a light hand. I will definitely repurchase this foundation!", "I am exploring with foundation and I abolutely love this foundation. I don't need full coverage but I only use half a pump for my whole face. I love the way it feels, it makes my skin flawless and gives a matte finish. I have dry skin and it works great for me!!! I's not only for oily skin just make sure you use a good moisturizer before and you are good.", "I used to use the cheap drug store foundation and there is nothing wrong with that but then my skin started breaking out and those products weren't doing anything for me. So I tried a lot of different foundations and this is by far my favorite. I have moderate acne and oily skin and this foundation has amazing coverage and you don't have to use a lot of it. I know its a little pricey but honestly its worth the cost and its lasts a while.", "This is my favorite foundation! Glad I tried it after hearing ladies rave about it so much! I have combination oily skin and it gives me FULL coverage and stays MATTE ALL DAY LONG! I recently had to attend a whole day event at an outdoor stadium- mid june, super hot and sweaty day. Applied it at 7 am and when I got home at 10 pm it was still matte!! Best feeling ever. I get so many compliments on how good it looks. When applied with my favorite primer it lasts even longer! I definitely recommend it. Tip- give it at least 3-5 minutes to set on your skin before applying your setting powder. And a little goes a long way! You only need a small amount of product for a full coverage. I use 1.5 drops only. And if you dont want heavy make up for day to day you can just apply one drop of this with your beauty blender and it goes on nice and light.", "I really like this foundation of the others. Very much full coverage and great for combo skin like mine. Doesn't leave me oily like others do.", "This is an amazing amazing foundation that i've used for about a year now.  I have combination skin with golden undertones (I use 53 in the winter and 57 around summer).  They cover EVERYTHING.  Amazing full coverage. HOWEVER, it does look super cakey and even after applying translucent powder still comes off easily from the face.  And I don't even use a full pump.  Would recommend if you have drier skin and would like to appear more luminous."], "date": ["30 May 2013", "20 Nov 2012", "14 Nov 2016", "25 Jun 2014", "18 Jan 2016", "30 Dec 2016"], "score": [5, 5, 5, 5, 4, 4], "title": ["Love, Love", "Great FULL coverage foundation!", "LOVEEE", "best foundation ever!", "great full coverage", "Awesome Foundation, For Some"]}, "figure_URL": ["https://www.sephora.com/productimages/sku/s1398858-main-grid.jpg"], "id": 8, "mini_figure_URL": ["https://www.sephora.com/productimages/sku/s1398858-main-grid.jpg"], "name": "Lock-It Foundation", "price": 18.0, "review_score": 3, "source": {"original_price": [18.0], "product_URL": ["https://www.sephora.com/product/lock-it-tattoo-foundation-P311138?icid2=products grid:p311138:product"], "source": ["Sephora"]}}