{
  "brand": "Dior",
  "comment": {
    "content": [
      "buildable coverage with even application every single time. Easy to use by spraying directly on to the face for a more translucent finish or by spraying onto a brush then blending.",
      "I am beyond obsessed with this product, I got into makeup when I was about 14, i’m 20 now and have never found a better foundation than this. I live in NYC where we have hot humid summers, this stays on so well without any primer or setting sprays, I even rinse my face off with water and it’s still intact, as I am a guy I like to keep it natural and nobody can tell I wear makeup, covers flawlessly with a damp beauty blender. I will buy this product as long as it exists, my second choice would be Giorgio Armani Luminous Silk.",
      "Skin looks amazing, full coverage, not the best if you have dry spots",
      "I love this, my go to foundation!! Beautiful finish.",
      "I’ve been trying different foundations but this has been the best!!! It leaves my skin so soft and gives it a natural look, will be using it for now on.",
      "So I am a bit of a beauty junkie and decided to splurge on this product over a year ago when it was part of a promotion where I got it for a discounted price. That day, I decided love it or hate it, it's a one time buy and I won't be spending $62 on it again. Needless to say, I'm on my 3rd can and I don't know how I did my makeup before I found this product! I personally apply it with a kabuki brush and buff it into my skin in small sections and the can lasts me about a good 4-6 weeks... A normal foundation lasts me about twice as long but you really do get what you pay for with this product! The finish is satiny, gorgeous, requies minimal setting, looks just amazing in photos, it makes dull skin look just flawless! Honestly, I feel like this isn't the best for people with really dry or super oily skin or for anyone looking for a full coverage foundation, but if you have only minor skin imperfections and want your skin to look like skin, only better, than this product is for you!",
      "This is the best foundation. It easily covers without t heavy feel. It goes on smoothly if you prepare your skin with Dior dreamskin. Love both",
      "I've been using Dior Airflash for about 3 years. Initially, I wanted an airbrush \"machine\" to make my make-up look more professional. I found Airflash and have been hooked since. You can spray it directly on your face; or, it's better to spray it onto a foundation brush. It dries quickly to almost a powder; except it does not come off!!! It doesn't get on your clothes, your collar, etc. Put a good moisturizer/brightener on first and it will help make your face look brighter. After proper application, you have a blank slate (your face) to work on. This stuff covers amazingly. I tend to have a reddish tint to my skin and have freckles on my forehead....it covers everything....and makes the perfect base to apply your other makeup. This is as close as you will get to a professional airbrush without having to pay someone or buy a machine that has to be constantly cleaned. The price is kind of steep, but if you use it for special occasions, it'll last a long time. BTW, ALL Dior makeup is amazing.",
      "Never used foundation before, since I started using this one I can not think of using anything else. Perfect look,very natural .",
      "I've used Dior for years, thought I'd try this. I do like it. I'm in my late fifties so I worry about any make-up creasing under my eye. This is nice and sheer. I like to look more natural. I started off spraying on a sponge but after awhile I was able to learn to do a light miss all over & then spray on a sponge & dab any spots needing more coverage and also dabbing under my eyes to make sure it was all even. It takes a few tries to get the spraying technique down. But once you do its great. You can use finishing powder or not. I didn't buy the brush. I have many kinds & sizes of make-up brushes but I prefer the make-up sponge to dab. I have a medium skin tone although it seems to have lighted as I age but the medium worked well for me. I will continue to use the airflash. I like it much better than the liquid. I wish the cost was less but to me it's important to have that flawless look. don't be afraid to give it a try. There's also a Dior website to help you choose the right color if there's not a local Macy's that carries Dior.",
      "I wasn't sure about it after reading reviews but the first time I used it I was in love. Yes it can be messy and get in your hair. But the coverage is awesome. I have roseca and it provides full coverage.I did order the lightest color and wish I had ordered a slightly darker shade. This is now my favorite foundation and I have used it products before.",
      "I have tried so many different things including the Luminess system and this stuff is way superior and looks better - and you can actually touch it afterwards. I would suggest the buffing brush. Smooths and evens it out and helps make it look flawless and natural.",
      "With a spray foundation like this one i found that it's important to apply it in a way that works best for you. For me, I found that applying it straight onto my face was not only messy, but didn't give me the even coverage I wanted. I purchased a \"face brush\" from real techniques and sprayed the foundation lightly onto the brush then buffed it onto my face which gave a very flawless and blended look. If you're someone who likes to apply this straight to the face i suggest putting your hair up in a towel (like people do when they've just gotten out of the shower.) This way you're protecting your hair from getting foundation sprayed in it... which can look a little funny. Although this product is rather pricey you're getting 2.1 FL OZ of product compared to the typical foundation which is usually around 1 FL OZ. Coverage is build able and a little bit of product goes a long way. My only two complaints are 1. the range of shades the product comes in and 2. it's hard to tell when you're running low on product. All in all this is the best foundation I've used :)"
    ],
    "date": [
      "1 May 2018",
      "4 Jul 2018",
      "10 Feb 2018",
      "5 Nov 2017",
      "24 Apr 2018",
      "04/11/16",
      "11/20/18",
      "08/17/16",
      "10/05/18",
      "01/28/17",
      "08/26/18",
      "08/28/18",
      "02/09/14"
    ],
    "score": [
      5,
      5,
      5,
      5,
      5,
      5,
      5,
      5,
      5,
      5,
      5,
      5,
      5
    ],
    "title": [
      "life changing",
      "Best Foundation Ever.",
      "My go to foundation, beautiful finish!",
      "Best  foundation",
      "Best Foundation - My Holy Grail!",
      "My holy grail",
      "Dior airflash",
      "BEST AIRBRUSH MAKEUP ON THE MARKET",
      "Love it",
      "Very Nice",
      "LOVE THIS!",
      "Flawless look & so easy",
      "Excellent Product"
    ]
  },
  "figure_URL": [
    "https://www.sephora.com/productimages/sku/s2050441-main-grid.jpg",
    "https://images.bloomingdalesassets.com/is/image/BLM/products/2/optimized/9898922_fpx.tif?$2014_BROWSE_FASHION$&hei=350&wid=280"
  ],
  "id": 9,
  "name": "Dior Airflash Spray Foundation",
  "price": 62,
  "review_score": 4,
  "source": {
    "original_price": [
      62,
      62
    ],
    "product_URL": [
      "https://www.sephora.com/product/diorskin-airflash-spray-foundation-P104914?icid2=products grid:p104914:product",
      "https://www.bloomingdales.com/shop/product/dior-diorskin-airflash-spray-foundation?ID=90581&CategoryID=2921"
    ],
    "source": [
      "Sephora",
      "Bloomindale"
    ]
  }
}